[
  {
    "id": 61,
    "imageUrl": "https://otimages.com/Bookcover/2012/9781958682012.jpg",
    "title": "Tucker",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "For tens of millions of Americans, Tucker Carlson was long the only voice on cable news providing a counternarrative to establishment Washington and the mainstream press on the most important issues of our time: the Covid-19 vaccine, January 6th, the Ukraine war, even UFOs, just to name a few.  His ratings -- the highest in cable news history -- spoke for themselves. But if there remained any doubt as to the esteem in which Carlson is held, not just by conservatives, but by all who feel alienated by our imperious and self-serving ruling class, it was evident in the outpouring of grief and anger that came with his abrupt firing from Fox News.  Who is Tucker Carlson off camera? How did his upbringing contribute to who he is today? What motivates the man who has been (and will surely reemerge) as the most influential and, in the establishment's eyes, the most dangerous voice in American politics and culture?  Author Chadwick Moore was granted unprecedented access to Carlson's professional and personal life. Based on hundreds of hours of interviews with Carlson, his family, colleagues, acquaintances, and enemies, Tucker offers an inside look into one of the most beloved -- and polarizing -- media figures of our time.",
    "price": 179.75,
    "discountPrice": 161.61,
    "isbn": "1958682012",
    "publisher": "ALL SEASONS PR",
    "publicationDate": "2023-08-01",
    "pages": 272,
    "postedBy": 30
  },
  {
    "id": 62,
    "imageUrl": "https://otimages.com/Bookcover/9048/9781668009048.jpg",
    "title": "The Woman in Me",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "\"In Britney Spears's memoir, she's stronger than ever.\" --The New York Times The Woman in Me is a brave and astonishingly moving story about freedom, fame, motherhood, survival, faith, and hope. In June 2021, the whole world was listening as Britney Spears spoke in open court. The impact of sharing her voice--her truth--was undeniable, and it changed the course of her life and the lives of countless others. The Woman in Me reveals for the first time her incredible journey--and the strength at the core of one of the greatest performers in pop music history. Written with remarkable candor and humor, Spears's groundbreaking book illuminates the enduring power of music and love--and the importance of a woman telling her own story, on her own terms, at last.",
    "price": 176.23,
    "discountPrice": 158.42,
    "isbn": "1668009048",
    "publisher": "GALLERY BOOKS",
    "publicationDate": "2023-10-24",
    "pages": 288,
    "postedBy": 22
  },
  {
    "id": 63,
    "imageUrl": "https://otimages.com/Bookcover/2064/9780316572064.jpg",
    "title": "Oath and Honor: A Memoir and a Warning",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "A gripping first-hand account of the January 6th, 2021 insurrection from inside the halls of Congress, from origins to aftermath, as Donald Trump and his enablers betrayed the American people and the Constitution--by the House Republican leader who dared to stand up to it.  In the aftermath of the 2020 presidential election, Donald Trump and many around him, including certain other elected Republican officials, intentionally breached their oath to the Constitution: they ignored the rulings of dozens of courts, plotted to overturn a lawful election, and provoked a violent attack on our Capitol. Liz Cheney, one of the few Republican officials to take a stand against these efforts, witnessed the attack first-hand, and then helped lead the Congressional Select Committee investigation into how it happened. In Oath and Honor, she tells the story of this perilous moment in our history, those who helped Trump spread the stolen election lie, those whose actions preserved our constitutional framework, and the risks we still face.",
    "price": 184,
    "discountPrice": 165.42,
    "isbn": "0316572063",
    "publisher": "LITTLE BROWN &amp; CO",
    "publicationDate": "2023-12-05",
    "pages": 384,
    "postedBy": 8
  },
  {
    "id": 64,
    "imageUrl": "https://otimages.com/Bookcover/6262/9780375726262.jpg",
    "title": "American Prometheus: The Inspiration for the Major Motion Picture Oppenheimer",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "\"American Prometheus\" is a rich evocation of America in mid-century and a compelling portrait of scientist J. Robert Oppenheimer, a man shaped by its major events--the Depression, World War II, and the Cold War....THE INSPIRATION FOR THE MAJOR MOTION PICTURE OPPENHEIMER - \"A riveting account of one of history's most essential and paradoxical figures.\"--Christopher Nolan #1 NEW YORK TIMES BESTSELLER - PULITZER PRIZE WINNER - The definitive biography of J. Robert Oppenheimer, one of the iconic figures of the twentieth century, a brilliant physicist who led the effort to build the atomic bomb for his country in a time of war, and who later found himself confronting the moral consequences of scientific progress. In this magisterial, acclaimed biography twenty-five years in the making, Kai Bird and Martin Sherwin capture Oppenheimer's life and times, from his early career to his central role in the Cold War. This is biography and history at its finest, riveting and deeply informative. \"A masterful account of Oppenheimer's rise and fall, set in the context of the turbulent decades of America's own transformation. It is a tour de force.\" --Los Angeles Times Book Review \"A work of voluminous scholarship and lucid insight, unifying its multifaceted portrait with a keen grasp of Oppenheimer's essential nature.... It succeeds in deeply fathoming his most damaging, self-contradictory behavior.\" --The New York Times",
    "price": 150.39,
    "discountPrice": 0,
    "isbn": "0375726268",
    "publisher": "VINTAGE",
    "publicationDate": "2006-04-11",
    "pages": 784,
    "postedBy": 17
  },
  {
    "id": 65,
    "imageUrl": "https://otimages.com/Bookcover/3752/9781735503752.jpg",
    "title": "Letters to Trump",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "",
    "price": 691.53,
    "discountPrice": 0,
    "isbn": "1735503754",
    "publisher": "WINNING TEAM PUB",
    "publicationDate": "2023-04-25",
    "pages": 320,
    "postedBy": 7
  },
  {
    "id": 66,
    "imageUrl": "https://otimages.com/Bookcover/6448/9781250866448.jpg",
    "title": "Friends, Lovers, and the Big Terrible Thing: A Memoir",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "INSTANT #1 NEW YORK TIMES BESTSELLER#1 INTERNATIONAL BESTSELLER  The BELOVED STAR OF FRIENDS takes us behind the scenes of the hit sitcom and his struggles with addiction in this \"CANDID, DARKLY FUNNY...POIGNANT\" memoir (The New York Times)  A MOST ANTICIPATED BOOK by Time, Associated Press, Goodreads, USA Today, and more! \"Hi, my name is Matthew, although you may know me by another name. My friends call me Matty. And I should be dead.\" So begins the riveting story of acclaimed actor Matthew Perry, taking us along on his journey from childhood ambition to fame to addiction and recovery in the aftermath of a life-threatening health scare. Before the frequent hospital visits and stints in rehab, there was five-year-old Matthew, who traveled from Montreal to Los Angeles, shuffling between his separated parents; fourteen-year-old Matthew, who was a nationally ranked tennis star in Canada; twenty-four-year-old Matthew, who nabbed a coveted role as a lead cast member on the talked-about pilot then called Friends Like Us. . . and so much more. In an extraordinary story that only he could tell--and in the heartfelt, hilarious, and warmly familiar way only he could tell it--Matthew Perry lays bare the fractured family that raised him (and also left him to his own devices), the desire for recognition that drove him to fame, and the void inside him that could not be filled even by his greatest dreams coming true. But he also details the peace he's found in sobriety and how he feels about the ubiquity of Friends, sharing stories about his castmates and other stars he met along the way. Frank, self-aware, and with his trademark humor, Perry vividly depicts his lifelong battle with addiction and what fueled it despite seemingly having it all. Friends, Lovers, and the Big Terrible Thing is an unforgettable memoir that is both intimate and eye-opening--as well as a hand extended to anyone struggling with sobriety. Unflinchingly honest, moving, and uproariously funny, this is the book fans have been waiting for.",
    "price": 164.5,
    "discountPrice": 147.89,
    "isbn": "1250866448",
    "publisher": "FLATIRON BOOKS",
    "publicationDate": "2022-11-01",
    "pages": 272,
    "postedBy": 22
  },
  {
    "id": 67,
    "imageUrl": "https://otimages.com/Bookcover/8285/9781668028285.jpg",
    "title": "Enough",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "#1 NEW YORK TIMES BESTSELLER Cassidy Hutchinson's desk was mere steps from the most controversial president in recent American history. Now, she provides a riveting account of her extraordinary experiences as an idealistic young woman thrust into the middle of a national crisis, where she risked everything to tell the truth about some of the most powerful people in Washington.  Ever since a childhood visit to Washington, DC, Cassidy Hutchinson aspired to serve her country in government. Raised in a working-class family with a military background, she was the first in her immediate family to graduate from college. Despite having no ties to Washington, Hutchinson landed a vital position at the center of the Trump White House. Her life took a dramatic turn on January 6th, 2021, when, at twenty-four, she found herself in one of the most extraordinary and unprecedented calamities in modern political history. Hutchinson was faced with a choice between loyalty to the Trump administration or loyalty to the country by revealing what she saw and heard in the attempt to overthrow a democratic election. She bravely came forward to become the pivotal witness in the House January 6 investigations, as her testimony transfixed and stunned the nation. In her memoir, Hutchinson reveals the struggle between the pressures she confronted to toe the party line and the demands of the oath she swore to defend American democracy. Enough reaches far beyond the typical insider political account. It's the saga of a woman whose fierce determination helped her overcome childhood challenges to get her dream job, only to face a crisis of conscience--one that more senior White House aides tried to evade--and, in the process, find her voice and herself. This is a portrait of how the courage of one person can change the course of history.",
    "price": 168.53,
    "discountPrice": 151.5,
    "isbn": "166802828X",
    "publisher": "SIMON &amp; SCHUSTER",
    "publicationDate": "2023-09-26",
    "pages": 384,
    "postedBy": 18
  },
  {
    "id": 68,
    "imageUrl": "https://otimages.com/Bookcover/1284/9781982181284.jpg",
    "title": "Elon Musk",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "#1 New York Times bestseller From the author of Steve Jobs and other bestselling biographies, this is the astonishingly intimate story of the most fascinating and controversial innovator of our era--a rule-breaking visionary who helped to lead the world into the era of electric vehicles, private space exploration, and artificial intelligence. Oh, and took over Twitter.  When Elon Musk was a kid in South Africa, he was regularly beaten by bullies. One day a group pushed him down some concrete steps and kicked him until his face was a swollen ball of flesh. He was in the hospital for a week. But the physical scars were minor compared to the emotional ones inflicted by his father, an engineer, rogue, and charismatic fantasist. His father's impact on his psyche would linger. He developed into a tough yet vulnerable man-child, prone to abrupt Jekyll-and-Hyde mood swings, with an exceedingly high tolerance for risk, a craving for drama, an epic sense of mission, and a maniacal intensity that was callous and at times destructive. At the beginning of 2022--after a year marked by SpaceX launching thirty-one rockets into orbit, Tesla selling a million cars, and him becoming the richest man on earth--Musk spoke ruefully about his compulsion to stir up dramas. \"I need to shift my mindset away from being in crisis mode, which it has been for about fourteen years now, or arguably most of my life,\" he said. It was a wistful comment, not a New Year's resolution. Even as he said it, he was secretly buying up shares of Twitter, the world's ultimate playground. Over the years, whenever he was in a dark place, his mind went back to being bullied on the playground. Now he had the chance to own the playground. For two years, Isaacson shadowed Musk, attended his meetings, walked his factories with him, and spent hours interviewing him, his family, friends, coworkers, and adversaries. The result is the revealing inside story, filled with amazing tales of triumphs and turmoil, that addresses the question: are the demons that drive Musk also what it takes to drive innovation and progress?",
    "price": 220.79,
    "discountPrice": 198.5,
    "isbn": "1982181281",
    "publisher": "SIMON &amp; SCHUSTER",
    "publicationDate": "2023-09-12",
    "pages": 688,
    "postedBy": 16
  },
  {
    "id": 69,
    "imageUrl": "https://otimages.com/Bookcover/8951/9781984898951.jpg",
    "title": "Crying in H Mart: A Memoir",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "#1 NEW YORK TIMES BESTSELLER - From the indie rock sensation known as Japanese Breakfast, an unforgettable memoir about family, food, grief, love, and growing up Korean American--\"in losing her mother and cooking to bring her back to life, Zauner became herself\" (NPR). - CELEBRATING OVER ONE YEAR ON THE NEW YORK TIMES BESTSELLER LIST In this exquisite story of family, food, grief, and endurance, Michelle Zauner proves herself far more than a dazzling singer, songwriter, and guitarist. With humor and heart, she tells of growing up one of the few Asian American kids at her school in Eugene, Oregon; of struggling with her mother's particular, high expectations of her; of a painful adolescence; of treasured months spent in her grandmother's tiny apartment in Seoul, where she and her mother would bond, late at night, over heaping plates of food. As she grew up, moving to the East Coast for college, finding work in the restaurant industry, and performing gigs with her fledgling band--and meeting the man who would become her husband--her Koreanness began to feel ever more distant, even as she found the life she wanted to live. It was her mother's diagnosis of terminal cancer, when Michelle was twenty-five, that forced a reckoning with her identity and brought her to reclaim the gifts of taste, language, and history her mother had given her. Vivacious and plainspoken, lyrical and honest, Zauner's voice is as radiantly alive on the page as it is onstage. Rich with intimate anecdotes that will resonate widely, and complete with family photos, Crying in H Mart is a book to cherish, share, and reread.",
    "price": 93.67,
    "discountPrice": 84.21,
    "isbn": "1984898957",
    "publisher": "VINTAGE",
    "publicationDate": "2023-03-28",
    "pages": 256,
    "postedBy": 15
  },
  {
    "id": 70,
    "imageUrl": "https://otimages.com/Bookcover/1100/9781596141100.jpg",
    "title": "Diary of Saint Maria Faustina Kowalska: Divine Mercy in My Soul",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "This bestselling book that birthed the Divine Mercy movement, one of the fastest growing movements in world today. This amazing narrrative will stir your heart and soul while it chronicles the experience of a simple Polish nun.",
    "price": 99.49,
    "discountPrice": 0,
    "isbn": "1596141107",
    "publisher": "MARIAN PR",
    "publicationDate": "2005-01-01",
    "pages": 730,
    "postedBy": 4
  },
  {
    "id": 71,
    "imageUrl": "https://otimages.com/Bookcover/9524/9780525429524.jpg",
    "title": "My Name Is Barbra",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "The long-awaited memoir by the superstar of stage, screen, recordings, and televisionBarbra Streisand is by any account a living legend, a woman who in a career spanning six decades has excelled in every area of entertainment. She is among the handful of EGOT winners (Emmy, Grammy, Oscar, and Tony) and has one of the greatest and most recognizable voices in the history of popular music. She has been nominated for a Grammy 46 times, and with Yentl she became the first woman to write, produce, direct, and star in a major motion picture. In My Name Is Barbra, she tells her own story about her life and extraordinary career, from growing up in Brooklyn to her first star-making appearances in New York nightclubs to her breakout performance in Funny Girl on stage and winning the Oscar for that performance on film. Then came a long string of successes in every medium in the years that followed. The book is, like Barbra herself, frank, funny, opinionated, and charming. She recounts her early struggles to become an actress, eventually turning to singing to earn a living; the recording of some of her acclaimed albums; the years of effort involved in making Yentl; her direction of The Prince of Tides; her friendships with figures ranging from Marlon Brando to Madeleine Albright; her political advocacy; and the fulfillment she's found in her marriage to James Brolin.  No entertainer's memoir has been more anticipated than Barbra Streisand's, and this engrossing and delightful book will be eagerly welcomed by her millions of fans.",
    "price": 298.73,
    "discountPrice": 268.55,
    "isbn": "0525429522",
    "publisher": "VIKING",
    "publicationDate": "2023-11-07",
    "pages": 992,
    "postedBy": 23
  },
  {
    "id": 72,
    "imageUrl": "https://otimages.com/Bookcover/5824/9781982185824.jpg",
    "title": "I'm Glad My Mom Died",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "* #1 NEW YORK TIMES BESTSELLER * #1 INTERNATIONAL BESTSELLER * MORE THAN 2 MILLION COPIES SOLD! A heartbreaking and hilarious memoir by iCarly and Sam &amp; Cat star Jennette McCurdy about her struggles as a former child actor--including eating disorders, addiction, and a complicated relationship with her overbearing mother--and how she retook control of her life.  Jennette McCurdy was six years old when she had her first acting audition. Her mother's dream was for her only daughter to become a star, and Jennette would do anything to make her mother happy. So she went along with what Mom called \"calorie restriction,\" eating little and weighing herself five times a day. She endured extensive at-home makeovers while Mom chided, \"Your eyelashes are invisible, okay? You think Dakota Fanning doesn't tint hers?\" She was even showered by Mom until age sixteen while sharing her diaries, email, and all her income. In I'm Glad My Mom Died, Jennette recounts all this in unflinching detail--just as she chronicles what happens when the dream finally comes true. Cast in a new Nickelodeon series called iCarly, she is thrust into fame. Though Mom is ecstatic, emailing fan club moderators and getting on a first-name basis with the paparazzi (\"Hi Gale!\"), Jennette is riddled with anxiety, shame, and self-loathing, which manifest into eating disorders, addiction, and a series of unhealthy relationships. These issues only get worse when, soon after taking the lead in the iCarly spinoff Sam &amp; Cat alongside Ariana Grande, her mother dies of cancer. Finally, after discovering therapy and quitting acting, Jennette embarks on recovery and decides for the first time in her life what she really wants. Told with refreshing candor and dark humor, I'm Glad My Mom Died is an inspiring story of resilience, independence, and the joy of shampooing your own hair.",
    "price": 153.84,
    "discountPrice": 0,
    "isbn": "1982185821",
    "publisher": "SIMON &amp; SCHUSTER",
    "publicationDate": "2022-08-09",
    "pages": 320,
    "postedBy": 21
  },
  {
    "id": 73,
    "imageUrl": "https://otimages.com/Bookcover/8791/9780062968791.jpg",
    "title": "Everything I Know about Love: A Memoir",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "New York Times Bestseller\"There is no writer quite like Dolly Alderton working today and very soon the world will know it.\" --Lisa Taddeo, author of #1 New York Times bestseller Three Women\"Dolly Alderton has always been a sparkling Roman candle of talent. She is funny, smart, and explosively engaged in the wonders and weirdness of the world. But what makes this memoir more than mere entertainment is the mature and sophisticated evolution that Alderton describes in these pages. It's a beautifully told journey and a thoughtful, important book. I loved it.\" --Elizabeth Gilbert, New York Times bestselling author of Eat, Pray, Love and City of GirlsThe wildly funny, occasionally heartbreaking internationally bestselling memoir about growing up, growing older, and learning to navigate friendships, jobs, loss, and love along the rideWhen it comes to the trials and triumphs of becoming an adult, journalist and former Sunday Times columnist Dolly Alderton has seen and tried it all. In her memoir, she vividly recounts falling in love, finding a job, getting drunk, getting dumped, realizing that Ivan from the corner shop might just be the only reliable man in her life, and that absolutely no one can ever compare to her best girlfriends. Everything I Know About Love is about bad dates, good friends and--above all else-- realizing that you are enough.Glittering with wit and insight, heart and humor, Dolly Alderton's unforgettable debut weaves together personal stories, satirical observations, a series of lists, recipes, and other vignettes that will strike a chord of recognition with women of every age--making you want to pick up the phone and tell your best friends all about it. Like Bridget Jones' Diary but all true, Everything I Know About Love is about the struggles of early adulthood in all its terrifying and hopeful uncertainty.",
    "price": 104.81,
    "discountPrice": 94.23,
    "isbn": "0062968793",
    "publisher": "PERENNIAL",
    "publicationDate": "2021-02-09",
    "pages": 368,
    "postedBy": 1
  },
  {
    "id": 74,
    "imageUrl": "https://otimages.com/Bookcover/3083/9781414333083.jpg",
    "title": "Son of Hamas",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "The oldest son of Sheikh Hassan Yousef, a founding member of Hamas, reveals new information about the world's most dangerous terrorist organization, unveils the truth about his own role in the organization, and explains his dangerous decision to make his newfound Christian faith public....Son of Hamas is now available with an all-new chapter about events since the book's release such as the revelation of Mosab's Israeli intelligence handler's true identity, and Homeland Security's effort to deport the author.Since he was a small boy, Mosab Hassan Yousef has had an inside view of the deadly terrorist group Hamas. The oldest son of Sheikh Hassan Yousef, a founding member of Hamas and its most popular leader, young Mosab assisted his father for years in his political activities while being groomed to assume his legacy, politics, status . . . and power. But everything changed when Mosab turned away from terror and violence, and embraced instead the teachings of another famous Middle East leader. In Son of Hamas, Mosab reveals new information about the world's most dangerous terrorist organization and unveils the truth about his own role, his agonizing separation from family and homeland, the dangerous decision to make his newfound faith public, and his belief that the Christian mandate to \"love your enemies\" is the only way to peace in the Middle East.",
    "price": 103.34,
    "discountPrice": 0,
    "isbn": "1414333080",
    "publisher": "SALT RIVER",
    "publicationDate": "2011-03-01",
    "pages": 304,
    "postedBy": 7
  },
  {
    "id": 75,
    "imageUrl": "https://otimages.com/Bookcover/6751/9781250326751.jpg",
    "title": "Beyond the Story: 10-Year Record of Bts",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "#1 New York Times Bestseller THE FIRST EVER OFFICIAL BOOK--Published in celebration of BTS's 10th Anniversary, stories that go beyond what you already know about BTS, including unreleased photos, QR codes of videos, and all album information. After taking their first step into the world on June 13, 2013, BTS will celebrate the 10th anniversary of their debut in June 2023. They have risen to the peak as an iconic global artist and during this meaningful time, they look back on their footsteps in the first official book. In doing so, BTS nurtures the power to build brighter days and they choose to take another step on a road that no one has gone before. BTS shares personal, behind-the-scenes stories of their journey so far through interviews and more than three years of in-depth coverage by Myeongseok Kang, who has written about K-pop and other Korean pop culture in various media. Presented chronologically in seven chapters from before the debut of BTS to the present, their vivid voices and opinions harmonize to tell a sincere, lively, and deep story. In individual interviews that have been conducted without a camera or makeup, they illuminate their musical journey from multiple angles and discuss its significance. In addition, portrait photos that show BTS as individuals and artists open the book, and throughout there are concept photos, tracklists of all previous albums, and over 330 QR codes. As digital artists, BTS has been communicating with the world through the internet and this book allows readers to immediately access trailers, music videos, and more online to have a rich understanding of all the key moments in BTS history. Complete with a timeline of all major milestones, BEYOND THE STORY  is a remarkable archive--truly everything about BTS in one volume.",
    "price": 264.17,
    "discountPrice": 0,
    "isbn": "1250326753",
    "publisher": "FLATIRON BOOKS",
    "publicationDate": "2023-07-09",
    "pages": 544,
    "postedBy": 21
  },
  {
    "id": 76,
    "imageUrl": "https://otimages.com/Bookcover/8359/9781250878359.jpg",
    "title": "Pageboy: A Memoir",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "#1 NEW YORK TIMES BESTSELLER \"Eloquent and enthralling...\" --Washington Post \"The emergence of our true selves is all of our life's work. Pageboy helps chart the course.\" --Jamie Lee Curtis\"Searing, deeply moving, and incredibly poignant... This isn't simply a book on what it means to be trans, it's about what it means to be human.\" --Alok Vaid-MenonNAMED A MOST ANTICIPATED BOOK by Salon, The Week, Elle, Bustle, and more. Full of intimate stories, from chasing down secret love affairs to battling body image and struggling with familial strife, Pageboy is a love letter to the power of being seen. With this evocative and lyrical debut, Oscar-nominated star Elliot Page captures the universal human experience of searching for ourselves and our place in this complicated world. \"Can I kiss you?\" It was two months before the world premiere of Juno, and Elliot Page was in his first ever queer bar. The hot summer air hung heavy around him as he looked at her. And then it happened. In front of everyone. A previously unfathomable experience. Here he was on the precipice of discovering himself as a queer person, as a trans person. Getting closer to his desires, his dreams, himself, without the repression he'd carried for so long. But for Elliot, two steps forward had always come with one step back. With Juno's massive success, Elliot became one of the world's most beloved actors. His dreams were coming true, but the pressure to perform suffocated him. He was forced to play the part of the glossy young starlet, a role that made his skin crawl, on and off set. The career that had been an escape out of his reality and into a world of imagination was suddenly a nightmare. As he navigated criticism and abuse from some of the most powerful people in Hollywood, a past that snapped at his heels, and a society dead set on forcing him into a binary, Elliot often stayed silent, unsure of what to do. Until enough was enough. The Oscar-nominated star who captivated the world with his performance in Juno finally shares his story in a groundbreaking and inspiring memoir about love, family, fame -- and stepping into who we truly are with strength, joy and connection.",
    "price": 157.11,
    "discountPrice": 141.23,
    "isbn": "1250878357",
    "publisher": "FLATIRON BOOKS",
    "publicationDate": "2023-06-06",
    "pages": 288,
    "postedBy": 15
  },
  {
    "id": 77,
    "imageUrl": "https://otimages.com/Bookcover/8255/9781400238255.jpg",
    "title": "Not That Fancy: Simple Lessons on Living, Loving, Eating, and Dusting Off Your Boots",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "NEW YORK TIMES BESTSELLER WALL STREET JOURNAL BESTSELLER USA TODAY BESTSELLERThe perfect Christmas gift for anyone who loves down-home recipes, the western lifestyle, heartwarming stories, and a good laugh from the Queen of Country!The best things in life are really not that fancy. This photo-driven book featuring all-things-Reba invites you to get back to the basics of life: fun, food, friends, and family. In her first book in over two decades, actress and country music legend Reba McEntire takes you behind the scenes and shares the stories, recipes, and Oklahoma-style truths that guide her life.FROM REBA: \"To me, there's nothing better than sitting on the back porch looking out at the land that goes on for miles. A beautiful sunset and then me, just sipping on a glass of iced tea (or whiskey and Sprite) with my friends and family. I don't know what heaven's going to look like, but I hope it feels like Oklahoma. Throw in some beans and cornbread, and I'm all set.\"Okies know that the secret to a good life is to keep things simple and be thankful for what the good Lord's given you. That's what I want to get back to. Simple fun, hard work, good food, and laughing with those you love. Everything I'm doing in my life from here on out--personal or professional, doesn't matter--I'm going to have fun.\"That's what I'm sharing in this book--some simple, not-that-fancy truths I live by and a bunch of good stories, photos, and recipes that go along with them. So if you're looking to slow down, get back to basics, and have a heckuva lot of fun, I think we're going to have a good time together in these pages. Come on in, kick off your boots (or leave them on, I don't care), and learn how to bring a little bit of my downhome-inspired life into your own.\"FROM THE PUBLISHER: Not That Fancy includes: Nearly 200 photographs from Reba's childhood, career, and personal life--many of which are straight from Reba's phoneNever-before-told stories from rodeoing with her family to pranks with Brooks &amp; Dunn to falling in love over a plate of tater totsBehind-the-scenes anecdotes from her music and acting career, with inspiration on how to follow your passion, trust your gut, and take a chance on yourselfMore than 60 recipes of appetizers, mains, sides, desserts, and cocktails from Reba's personal kitchen, from friends and family, and from her restaurant, Reba's PlaceLighthearted lifestyle tips on how to achieve Reba's signature hairstyle, plan a down-to-earth date night, throw an effortless dinner party, and moreNot That Fancy is the perfect deluxe gift for Christmas, birthdays, Mother's Day, Father's Day, and special occasions. This keepsake book is ideal for Reba fans, country music lovers, or anyone who enjoys an easygoing western lifestyle.",
    "price": 215.9,
    "discountPrice": 0,
    "isbn": "1400238250",
    "publisher": "THOMAS NELSON PUB",
    "publicationDate": "2023-10-10",
    "pages": 288,
    "postedBy": 8
  },
  {
    "id": 78,
    "imageUrl": "https://otimages.com/Bookcover/7323/9780525657323.jpg",
    "title": "The Art Thief: A True Story of Love, Crime, and a Dangerous Obsession",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "NEW YORK TIMES BEST SELLER - One of the most remarkable true-crime narratives of the twenty-first century: the story of the world's most prolific art thief, Stéphane Breitwieser. - \"The Art Thief, like its title character, has confidence, élan, and a great sense of timing.\"--The New Yorker  \"Enthralling.\" --The Wall Street Journal In this spellbinding portrait of obsession and flawed genius, the best-selling author of The Stranger in the Woods brings us into Breitwieser's strange world--unlike most thieves, he never stole for money, keeping all his treasures in a single room where he could admire them. For centuries, works of art have been stolen in countless ways from all over the world, but no one has been quite as successful at it as the master thief Stéphane Breitwieser. Carrying out more than two hundred heists over nearly eight years--in museums and cathedrals all over Europe--Breitwieser, along with his girlfriend who worked as his lookout, stole more than three hundred objects, until it all fell apart in spectacular fashion. In The Art Thief,  Michael Finkel brings us into Breitwieser's strange and fascinating world. Unlike most thieves, Breitwieser never stole for money. Instead, he displayed all his treasures in a pair of secret rooms where he could admire them to his heart's content. Possessed of a remarkable athleticism and an innate ability to circumvent practically any security system, Breitwieser managed to pull off a breathtaking number of audacious thefts. Yet these strange talents bred a growing disregard for risk and an addict's need to score, leading Breitwieser to ignore his girlfriend's pleas to stop--until one final act of hubris brought everything crashing down. This is a riveting story of art, crime, love, and an insatiable hunger to possess beauty at any cost.",
    "price": 151.03,
    "discountPrice": 135.78,
    "isbn": "0525657320",
    "publisher": "KNOPF",
    "publicationDate": "2023-06-27",
    "pages": 240,
    "postedBy": 3
  },
  {
    "id": 79,
    "imageUrl": "https://otimages.com/Bookcover/0016/9780374500016.jpg",
    "title": "Night",
    "genre": "Biography & Autobiography",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "A new translation from the French by Marion Wiesel. Night is Elie Wiesel's masterpiece, a candid, horrific, and deeply poignant autobiographical account of his survival as a teenager in the Nazi death camps.This new translation by Marion Wiesel, Elie's wife and frequent translator, presents this seminal memoir in the language and spirit truest to the author's original intent. And in a substantive new preface, Elie reflects on the enduring importance of Night and his lifelong, passionate dedication to ensuring that the world never forgets man's capacity for inhumanity to man. Night offers much more than a litany of the daily terrors, everyday perversions, and rampant sadism at Auschwitz and Buchenwald; it also eloquently addresses many of the philosophical as well as personal questions implicit in any serious consideration of what the Holocaust was, what it meant, and what its legacy is and will be.",
    "price": 63.57,
    "discountPrice": 0,
    "isbn": "0374500010",
    "publisher": "FARRAR STRAUSS &amp; GIROUX",
    "publicationDate": "2006-01-16",
    "pages": 144,
    "postedBy": 19
  }
]