[
  {
    "id": 21,
    "imageUrl": "https://otimages.com/Bookcover/6581/9780062976581.jpg",
    "title": "The Boy, the Mole, the Fox and the Horse: A Great Gift for Book Lovers",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "From a revered British illustrator comes a modern fable for all ages that explores life's universal lessons, featuring 100 color and black-and-white drawings....A Great Gift for Book LoversCharlie Mackesy's beloved The Boy, the Mole, the Fox and the Horse has been adapted into an Academy Award(R) winning animated short film, now available to stream on Apple TV+#1 NEW YORK TIMES BESTSELLER - WALL STREET JOURNAL BESTSELLER  - USA TODAY BESTSELLER\"The Boy, the Mole, the Fox and the Horse is not only a thought-provoking, discussion-worthy story, the book itself is an object of art.\"- Elizabeth Egan, The New York TimesFrom British illustrator, artist, and author Charlie Mackesy comes a journey for all ages that explores life's universal lessons, featuring 100 color and black-and-white drawings.\"What do you want to be when you grow up?\" asked the mole.\"Kind,\" said the boy.Charlie Mackesy offers inspiration and hope in uncertain times in this beautiful book, following the tale of a curious boy, a greedy mole, a wary fox and a wise horse who find themselves together in sometimes difficult terrain, sharing their greatest fears and biggest discoveries about vulnerability, kindness, hope, friendship and love. The shared adventures and important conversations between the four friends are full of life lessons that have connected with readers of all ages.",
    "price": 125.74,
    "discountPrice": 0,
    "isbn": "0062976583",
    "publisher": "HARPER ONE",
    "publicationDate": "2019-10-22",
    "pages": 128,
    "postedBy": 20
  },
  {
    "id": 22,
    "imageUrl": "https://otimages.com/Bookcover/4716/9781962404716.jpg",
    "title": "Female Force Taylor Swift Dazzler Homage Variant",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "",
    "price": 66.77,
    "discountPrice": 60.03,
    "isbn": "1962404714",
    "publisher": "TIDALWAVE PROD",
    "publicationDate": "2023-12-13",
    "pages": 26,
    "postedBy": 8
  },
  {
    "id": 23,
    "imageUrl": "https://otimages.com/Bookcover/8435/9781427868435.jpg",
    "title": "Disney Manga: Tim Burton's the Nightmare Before Christmas - The Battle for Pumpkin King",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "The New York Times Best Seller!  Jack Skellington is the undisputed Pumpkin King of Halloween Town. But it wasn't always that way...  Years ago, Jack and Oogie Boogie were close friends. Both eager to prove themselves, they poured all their passion into their fantastical projects to earn their rightful place as the scariest duo in town. But there could only be one Pumpkin King! What could have happened to turn two best friends into such bitter rivals? \"Even if you are not familiar with the original film, the graphic novel The Nightmare Before Christmas: The Battle For Pumpkin King does justice to the original. Dan Conner's writing flows the story with the right amount of humour. Deborah Allo draws every line as if the environment and the characters are alive and we are there in the town with them. We can not miss the finesse in colouring that Roberto Scalia executes. My overall impression is that this story is beautifully illustrated; it has easy-to-follow, funny dialogues with cleverly placed subtexts on the importance of friendship and honesty.\" -- Ilgın Side Soysal, The Comics Beat",
    "price": 102.75,
    "discountPrice": 92.38,
    "isbn": "1427868433",
    "publisher": "DISNEY MANGA",
    "publicationDate": "2023-09-26",
    "pages": 128,
    "postedBy": 12
  },
  {
    "id": 24,
    "imageUrl": "https://otimages.com/Bookcover/9017/9781569319017.jpg",
    "title": "One Piece, Vol. 1",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "A new shonen sensation in Japan, this series features Monkey D. Luffy, whose main ambition is to become a pirate....Join Monkey D. Luffy and his swashbuckling crew in their search for the ultimate treasure, One Piece! As a child, Monkey D. Luffy dreamed of becoming King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber...at the cost of never being able to swim again! Years, later, Luffy sets off in search of the \"One Piece,\" said to be the greatest treasure in the world... As a child, Monkey D. Luffy was inspired to become a pirate by listening to the tales of the buccaneer \"Red-Haired\" Shanks. But his life changed when Luffy accidentally ate the Gum-Gum Devil Fruit and gained the power to stretch like rubber...at the cost of never being able to swim again! Years later, still vowing to become the king of the pirates, Luffy sets out on his adventure...one guy alone in a rowboat, in search of the legendary \"One Piece,\" said to be the greatest treasure in the world...",
    "price": 68.17,
    "discountPrice": 61.28,
    "isbn": "1569319014",
    "publisher": "VIZ LLC",
    "publicationDate": "2003-09-02",
    "pages": 216,
    "postedBy": 17
  },
  {
    "id": 25,
    "imageUrl": "https://otimages.com/Bookcover/9939/9781974709939.jpg",
    "title": "Chainsaw Man, Vol. 1",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Broke young man + chainsaw demon = Chainsaw Man! Denji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous--Chainsaw Man! Denji's a poor young man who'll do anything for money, even hunting down devils with his pet devil Pochita. He's a simple man with simple dreams, drowning under a mountain of debt. But his sad life gets turned upside down one day when he's betrayed by someone he trusts. Now with the power of a devil inside him, Denji's become a whole new man--Chainsaw Man!",
    "price": 66.42,
    "discountPrice": 0,
    "isbn": "1974709930",
    "publisher": "VIZ LLC",
    "publicationDate": "2020-10-06",
    "pages": 192,
    "postedBy": 23
  },
  {
    "id": 26,
    "imageUrl": "https://otimages.com/Bookcover/6255/9781421536255.jpg",
    "title": "One Piece (Omnibus Edition), Vol. 1: Includes Vols. 1, 2 &amp; 3",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Join Monkey D. Luffy and his swashbuckling crew in their search for the ultimate treasure, the One Piece. As a child, Monkey D. Luffy dreamed of becoming King of the Pirates. But his life changed when he accidentally ate the Gum-Gum Fruit, an enchanted Devil Fruit that gave him the ability to stretch like rubber. Its only drawback? He'll never be able to swim again--a serious handicap for an aspiring sea dog! Years later, Luffy sets off on his quest to find the \"One Piece,\" said to be the greatest treasure in the world... Get Ready to Set Sail! The treasure trove of high seas adventures just got bigger with this collection of the first three volumes of One Piece!",
    "price": 111.25,
    "discountPrice": 100.02,
    "isbn": "1421536250",
    "publisher": "VIZ LLC",
    "publicationDate": "2009-12-01",
    "pages": 608,
    "postedBy": 13
  },
  {
    "id": 27,
    "imageUrl": "https://otimages.com/Bookcover/5466/9781974715466.jpg",
    "title": "Spy X Family, Vol. 1",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "An action-packed comedy about a fake family that includes a spy, an assassin and a telepath! Master spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment--to get married and have a kid--he may finally be in over his head! Not one to depend on others, Twilight has his work cut out for him procuring both a wife and a child for his mission to infiltrate an elite private school. What he doesn't know is that the wife he's chosen is an assassin and the child he's adopted is a telepath!",
    "price": 67.88,
    "discountPrice": 61.03,
    "isbn": "1974715469",
    "publisher": "VIZ LLC",
    "publicationDate": "2020-06-02",
    "pages": 220,
    "postedBy": 27
  },
  {
    "id": 28,
    "imageUrl": "https://otimages.com/Bookcover/0027/9781974710027.jpg",
    "title": "Jujutsu Kaisen, Vol. 1",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural! In a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural! Although Yuji Itadori looks like your average teenager, his immense physical strength is something to behold! Every sports club wants him to join, but Itadori would rather hang out with the school outcasts in the Occult Research Club. One day, the club manages to get their hands on a sealed cursed object. Little do they know the terror they'll unleash when they break the seal...",
    "price": 73.06,
    "discountPrice": 0,
    "isbn": "1974710025",
    "publisher": "VIZ LLC",
    "publicationDate": "2019-12-03",
    "pages": 192,
    "postedBy": 15
  },
  {
    "id": 29,
    "imageUrl": "https://otimages.com/Bookcover/0581/9781974740581.jpg",
    "title": "Chainsaw Man, Vol. 12",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Broke young man + chainsaw demon = Chainsaw Man! Denji was a small-time devil hunter just trying to survive in a harsh world. After being killed on a job, he is revived by his pet devil Pochita and becomes something new and dangerous--Chainsaw Man! Meet awkward high school student Asa Mitaka. She may have trouble getting along with her fellow students and the class pet devil chicken, but Asa has something special going for her. And it may lead her right to Chainsaw Man!",
    "price": 66.71,
    "discountPrice": 0,
    "isbn": "1974740587",
    "publisher": "VIZ LLC",
    "publicationDate": "2023-10-03",
    "pages": 200,
    "postedBy": 17
  },
  {
    "id": 30,
    "imageUrl": "https://otimages.com/Bookcover/9618/9780785199618.jpg",
    "title": "Spider-Man: Miles Morales Vol. 1",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Miles Morales is hitting the big time! Not only is he joining the Marvel Universe, but he's also a card-carrying Avenger, rubbing shoulders with the likes of Iron Man, Thor and Captain America! And he'll soon be a media sensation in this All-New, All-Different New York! One thing's the same, though: non-stop action! Like when Earth's Mightiest heroes all fall, and Miles stands alone against a villain with the power to destroy the universe. Or when the Black Cat tries to get her claws in this new Spider-Man. Or when a new mutant threatens to grab the spotlight! And don't forget Miles' toughest foe yet: his grandmother! But his grades might be the ultimate challenge - maybe a study session (date?) with Ms. Marvel would help? Welcome to the neighborhood, Spider-Man - hope it's friendly! Collecting SPIDER-MAN (2016) #1-5.",
    "price": 86.16,
    "discountPrice": 77.45,
    "isbn": "0785199616",
    "publisher": "MARVEL COMICS GROUP",
    "publicationDate": "2016-09-06",
    "pages": 112,
    "postedBy": 9
  },
  {
    "id": 31,
    "imageUrl": "https://otimages.com/Bookcover/0523/9781974700523.jpg",
    "title": "Demon Slayer: Kimetsu No Yaiba, Vol. 1",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Tanjiro sets out on the path of the Demon Slayer to save his sister and avenge his family! In Taisho-era Japan, kindhearted Tanjiro Kamado makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life. Learning to destroy demons won't be easy, and Tanjiro barely knows where to start. The surprise appearance of another boy named Giyu, who seems to know what's going on, might provide some answers--but only if Tanjiro can stop Giyu from killing his sister first!",
    "price": 66.42,
    "discountPrice": 0,
    "isbn": "1974700526",
    "publisher": "VIZ LLC",
    "publicationDate": "2018-07-03",
    "pages": 192,
    "postedBy": 4
  },
  {
    "id": 32,
    "imageUrl": "https://otimages.com/Bookcover/1325/9781421561325.jpg",
    "title": "Uzumaki (3-In-1 Deluxe Edition)",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "A masterpiece of horror manga, now available in a deluxe hardcover edition! Kurouzu-cho, a small fogbound town on the coast of Japan, is cursed. According to Shuichi Saito, the withdrawn boyfriend of teenager Kirie Goshima, their town is haunted not by a person or being but a pattern: UZUMAKI, the spiral--the hypnotic secret shape of the world. The bizarre masterpiece horror manga is now available all in a single volume. Fall into a whirlpool of terror!",
    "price": 221.65,
    "discountPrice": 0,
    "isbn": "1421561328",
    "publisher": "VIZ LLC",
    "publicationDate": "2013-10-15",
    "pages": 648,
    "postedBy": 14
  },
  {
    "id": 33,
    "imageUrl": "https://otimages.com/Bookcover/0561/9781421590561.jpg",
    "title": "Tomie: Complete Deluxe Edition",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "The complete classic horror series, now available in a single deluxe volume. Murdered again and again, one girl always comes back for more... Tomie Kawakami is a femme fatale with long black hair and a beauty mark just under her left eye. She can seduce nearly any man, and drive them to murder as well, even though the victim is often Tomie herself. While one lover seeks to keep her for himself, another grows terrified of the immortal succubus. But soon they realize that no matter how many times they kill her, the world will never be free of Tomie.",
    "price": 255.65,
    "discountPrice": 229.84,
    "isbn": "1421590565",
    "publisher": "VIZ LLC",
    "publicationDate": "2016-12-20",
    "pages": 752,
    "postedBy": 2
  },
  {
    "id": 34,
    "imageUrl": "https://otimages.com/Bookcover/4002/9781549304002.jpg",
    "title": "Gender Queer: A Memoir",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "2020 ALA Alex Award Winner 2020 Stonewall -- Israel Fishman Non-fiction Award Honor Book In 2014, Maia Kobabe, who uses e/em/eir pronouns, thought that a comic of reading statistics would be the last autobiographical comic e would ever write. At the time, it was the only thing e felt comfortable with strangers knowing about em. Now, Gender Queer is here. Maia's intensely cathartic autobiography charts eir journey of self-identity, which includes the mortification and confusion of adolescent crushes, grappling with how to come out to family and society, bonding with friends over erotic gay fanfiction, and facing the trauma and fundamental violation of pap smears.  Started as a way to explain to eir family what it means to be nonbinary and asexual, Gender Queer is more than a personal story: it is a useful and touching guide on gender identity--what it means and how to think about it--for advocates, friends, and humans everywhere. \"It's also a great resource for those who identify as nonbinary or asexual as well as for those who know someone who identifies that way and wish to better understand.\" -- SLJ (starred review)",
    "price": 137.54,
    "discountPrice": 0,
    "isbn": "1549304003",
    "publisher": "LION FORGE COMICS",
    "publicationDate": "2019-05-28",
    "pages": 240,
    "postedBy": 2
  },
  {
    "id": 35,
    "imageUrl": "https://otimages.com/Bookcover/4949/9781524884949.jpg",
    "title": "The Mysteries",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "A New York Times, USA Today, Publishers Weekly, and Indie Bestseller.  From Bill Watterson, bestselling creator of the beloved comic strip Calvin and Hobbes, and John Kascht, one of America's most renowned caricaturists, comes a mysterious and beautifully illustrated fable about what lies beyond human understanding.  In a fable for grown-ups by cartoonist Bill Watterson, a long-ago kingdom is afflicted with unexplainable calamities. Hoping to end the torment, the king dispatches his knights to discover the source of the mysterious events. Years later, a single battered knight returns.  For the book's illustrations, Watterson and caricaturist John Kascht worked together for several years in unusually close collaboration. Both artists abandoned their past ways of working, inventing images together that neither could anticipate--a mysterious process in its own right.  With The Mysteries, Watterson and Kascht share the fascinating genesis of their extraordinary collaboration in a video that can be viewed on Andrews McMeel Publishing's YouTube page.",
    "price": 117.99,
    "discountPrice": 0,
    "isbn": "1524884944",
    "publisher": "ANDREWS &amp; MCMEEL",
    "publicationDate": "2023-10-10",
    "pages": 72,
    "postedBy": 22
  },
  {
    "id": 36,
    "imageUrl": "https://otimages.com/Bookcover/0041/9781974710041.jpg",
    "title": "Jujutsu Kaisen, Vol. 3",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural! In a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural! Tensions are high as the Goodwill Event between the Tokyo and Kyoto campuses of Jujutsu High approaches. But before the competition can even begin, a couple of Kyoto students confront Fushiguro and Kugisaki. Meanwhile, Yuji's training gets interrupted by a mysterious crime involving grotesque bodily alterations caused by a cursed spirit...",
    "price": 73.06,
    "discountPrice": 65.69,
    "isbn": "1974710041",
    "publisher": "VIZ LLC",
    "publicationDate": "2020-04-07",
    "pages": 192,
    "postedBy": 15
  },
  {
    "id": 37,
    "imageUrl": "https://otimages.com/Bookcover/9136/9781534399136.jpg",
    "title": "Saga Volume 11",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "While Hazel and her family fight for scraps to survive, the rich and powerful race to forge new allegiances in the universe's never-ending war.   Romeo &amp; Juliet meets Star Wars in this genre-blending, sci-fi/fantasy space opera about star crossed lovers from enemy worlds. An epic for mature readers, Saga follows new parents Marko and Alana as they risk everything to raise their child amidst a never-ending galactic war. A multiple award winning, critically acclaimed masterpiece and one of the most iconic, bestselling comic book series of its time.  The SAGA series has sold over 7 million copies to date across all formats, has been translated into 20 languages, and has garnered multiple Eisner and Harvey Awards, plus a Hugo Award, British Fantasy Award, Goodreads Choice Award, Shuster Award, Inkwell Award, Ringo Award, and more. It has been featured in such mainstream media outlets as TIME, Entertainment Weekly, The Atlantic, NPR, and beyond, and has become a pop culture phenomenon.  Collects SAGA #61-66.",
    "price": 107.78,
    "discountPrice": 96.89,
    "isbn": "1534399135",
    "publisher": "IMAGE COMICS",
    "publicationDate": "2023-11-29",
    "pages": 160,
    "postedBy": 30
  },
  {
    "id": 38,
    "imageUrl": "https://otimages.com/Bookcover/3178/9781975363178.jpg",
    "title": "[Oshi No Ko], Vol. 1",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "",
    "price": 79.74,
    "discountPrice": 0,
    "isbn": "1975363175",
    "publisher": "YEN PR",
    "publicationDate": "2023-01-17",
    "pages": 228,
    "postedBy": 24
  },
  {
    "id": 39,
    "imageUrl": "https://otimages.com/Bookcover/0149/9781974720149.jpg",
    "title": "Jujutsu Kaisen 0",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Yuta Okkotsu is a nervous high school student who is suffering from a serious problem--his childhood friend Rika has turned into a curse and won't leave him alone. Since Rika is no ordinary curse, his plight is noticed by Satoru Gojo, a teacher at Jujutsu High.High....The prequel to the supernatural exorcist adventure Jujutsu Kaisen! In a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural! Yuta Okkotsu is a nervous high school student who is suffering from a serious problem--his childhood friend Rika has turned into a Curse and won't leave him alone. Since Rika is no ordinary Curse, his plight is noticed by Satoru Gojo, a teacher at Jujutsu High, a school where fledgling exorcists learn how to combat Curses. Gojo convinces Yuta to enroll, but can he learn enough in time to confront the Curse that haunts him?",
    "price": 73.06,
    "discountPrice": 0,
    "isbn": "1974720144",
    "publisher": "VIZ LLC",
    "publicationDate": "2021-01-05",
    "pages": 200,
    "postedBy": 5
  },
  {
    "id": 40,
    "imageUrl": "https://otimages.com/Bookcover/5953/9781974725953.jpg",
    "title": "Demon Slayer Complete Box Set: Includes Volumes 1-23 with Premium",
    "genre": "Comics & Graphic Novels",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Tanjiro sets out on the path of the Demon Slayer to save his sister and avenge his family! In Taisho-era Japan, kindhearted Tanjiro Kamado makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life. The complete saga of Demon Slayer,  all in one epic box set! This box set contains all 23 volumes of the global hit Demon Slayer as well as an exclusive booklet and a double-sided poster.",
    "price": 0,
    "discountPrice": 0,
    "isbn": "1974725952",
    "publisher": "VIZ LLC",
    "publicationDate": "2021-11-09",
    "pages": 4496,
    "postedBy": 15
  }
]