[
  {
    "id": 41,
    "imageUrl": "https://otimages.com/Bookcover/1614/9781592851614.jpg",
    "title": "Drop the Rock: Removing Character Defects, Steps Six and Seven",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "A practical guide to letting go of the character defects that get in the way of true and joyful recovery. Resentment. Fear. Self-Pity. Intolerance. Anger. As Bill P. explains, these are the \"rocks\" that can sink recovery--or at the least, block further progress. Based on the principles behind Steps Six and Seven, Drop the Rock combines personal stories, practical advice, and powerful insights to help readers move forward in recovery. The second edition features additional stories and a reference section.",
    "price": 93.67,
    "discountPrice": 0,
    "isbn": "1592851614",
    "publisher": "HAZELDEN PUB",
    "publicationDate": "2005-02-11",
    "pages": 103,
    "postedBy": 1
  },
  {
    "id": 42,
    "imageUrl": "https://otimages.com/Bookcover/6371/9780894866371.jpg",
    "title": "The Language of Letting Go",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Written for those of us who struggle with codependency, these daily meditations offer growth and renewal, and remind us that the best thing we can do is take responsibility for our own self-care. Melody Beattie integrates her own life experiences and fundamental recovery reflections in this unique daily meditation book written especially for those of us who struggle with the issue of codependency. Problems are made to be solved, Melody reminds us, and the best thing we can do is take responsibility for our own pain and self-care. In this daily inspirational book, Melody provides us with a thought to guide us through the day and she encourages us to remember that each day is an opportunity for growth and renewal.",
    "price": 116.03,
    "discountPrice": 104.31,
    "isbn": "0894866370",
    "publisher": "HAZELDEN PUB",
    "publicationDate": "1990-06-01",
    "pages": 408,
    "postedBy": 27
  },
  {
    "id": 43,
    "imageUrl": "https://otimages.com/Bookcover/2886/9780593652886.jpg",
    "title": "The Creative ACT: A Way of Being",
    "genre": "Self-Help",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "The #1 New York Times bestseller. \"A gorgeous and inspiring work of art on creation, creativity, the work of the artist. It will gladden the hearts of writers and artists everywhere, and get them working again with a new sense of meaning and direction. A stunning accomplishment.\" --Anne Lamott From the legendary music producer, a master at helping people connect with the wellsprings of their creativity, comes a beautifully crafted book many years in the making that offers that same deep wisdom to all of us. \"I set out to write a book about what to do to make a great work of art. Instead, it revealed itself to be a book on how to be.\" --Rick Rubin Many famed music producers are known for a particular sound that has its day. Rick Rubin is known for something else: creating a space where artists of all different genres and traditions can home in on who they really are and what they really offer. He has made a practice of helping people transcend their self-imposed expectations in order to reconnect with a state of innocence from which the surprising becomes inevitable. Over the years, as he has thought deeply about where creativity comes from and where it doesn't, he has learned that being an artist isn't about your specific output, it's about your relationship to the world. Creativity has a place in everyone's life, and everyone can make that place larger. In fact, there are few more important responsibilities. The Creative Act is a beautiful and generous course of study that illuminates the path of the artist as a road we all can follow. It distills the wisdom gleaned from a lifetime's work into a luminous reading experience that puts the power to create moments--and lifetimes--of exhilaration and transcendence within closer reach for all of us.",
    "price": 199.93,
    "discountPrice": 0,
    "isbn": "0593652886",
    "publisher": "PENGUIN PR",
    "publicationDate": "2023-01-17",
    "pages": 432,
    "postedBy": 25
  },
  {
    "id": 44,
    "imageUrl": "https://otimages.com/Bookcover/2273/9781544512273.jpg",
    "title": "Can't Hurt Me: Master Your Mind and Defy the Odds",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Over 5 million copies soldFor David Goggins, childhood was a nightmare - poverty, prejudice, and physical abuse colored his days and haunted his nights. But through self-discipline,  mental toughness,  and hard work, Goggins transformed himself from a depressed, overweight young man with no future into a U.S. Armed Forces icon and one of the world's top endurance athletes. The only man in history to complete elite training as a Navy SEAL, Army Ranger, and Air Force Tactical Air Controller, he went on to set records in numerous endurance events, inspiring Outside magazine to name him \"The Fittest (Real) Man in America.\"In Can't Hurt Me, he shares his astonishing life story and reveals that most of us tap into only 40% of our capabilities. Goggins calls this The 40% Rule, and his story illuminates a path that anyone can follow to push past pain, demolish fear, and reach their full potential.",
    "price": 186.28,
    "discountPrice": 167.47,
    "isbn": "1544512279",
    "publisher": "LIONCREST PUB",
    "publicationDate": "2018-10-11",
    "pages": 364,
    "postedBy": 11
  },
  {
    "id": 45,
    "imageUrl": "https://otimages.com/Bookcover/1977/9781886941977.jpg",
    "title": "The ADHD Effect on Marriage: Understand and Rebuild Your Relationship in Six Steps",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Updated in 2020  invaluable resource for couples in which one or both partners have Attention Deficit Hyperactivity Disorder (ADHD), this authoritative book guides troubled partners towards an understanding and appreciation for the struggles and triumphs of a relationship affected by it, and to integrate ADHD into their relationship in a more positive and less disruptive way. Going beyond traditional marriage counseling which can often discount the influence of ADHD, this discussion offers advice from the author's personal experience and years of research and identifies patterns of behavior that can hurt marriages--such as nagging, intimacy problems, sudden anger, and memory issues--through the use of descriptions of actual couples and their ADHD struggles and solutions. The first third of the book is dedicated to helping couples identify how ADHD impacts their relationship. The last two-thirds provides a specific set of steps couples can move through to overcome their hurt and anger, once again develop loving ways to interact with each other, and find the joy they've lost in their struggles. This book encourages both spouses to become active partners in improving their relationship.",
    "price": 111.84,
    "discountPrice": 0,
    "isbn": "1886941971",
    "publisher": "SPECIALTY PR INC",
    "publicationDate": "2010-09-01",
    "pages": 225,
    "postedBy": 24
  },
  {
    "id": 46,
    "imageUrl": "https://otimages.com/Bookcover/9938/9780894869938.jpg",
    "title": "A Woman's Way Through the Twelve Steps",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Created to make the Twelve Step program more accessible to women and the way they experience addiction, this book illuminates each step to reveal the underlying meaning from a woman's viewpoint. In the second part, the author discusses major themes in the lives of recovering women, including spirituality, powerlessness, and the emergence of the feminine soul....Geared specifically to women, this book brings a feminine perspective to the Twelve Step program, searching out the healing messages beneath the male-oriented words. Recovery is not a man's world, and yet to a woman it can sometimes seem that way. Geared specifically to that woman, this book brings a feminine perspective to the Twelve Step program, searching out the healing messages beneath the male-oriented words. Based on an open exploration and a flexible interpretation of the Twelve Steps, this new perspective takes into account the psychological development of women as it relates to addiction and recovery, as well as the social and cultural factors that affect women in particular. Acknowledging that recovery raises special issues for women--from questions about sexuality, relationships, and everyday life to anxieties about speaking up at mixed-gender meetings--A Woman's Way through the Twelve Steps focuses directly on the feminine experience of addiction and healing. The author explores the Twelve Steps one by one, reiterating each in its traditional language, then explaining and illustrating it in a way that highlights a woman's experience--empowering the reader to take ownership of her own recovery process as well as her growth as a woman.",
    "price": 111.98,
    "discountPrice": 0,
    "isbn": "0894869930",
    "publisher": "HAZELDEN PUB",
    "publicationDate": "1994-09-27",
    "pages": 264,
    "postedBy": 12
  },
  {
    "id": 47,
    "imageUrl": "https://otimages.com/Bookcover/6503/9798986406503.jpg",
    "title": "Don't Believe Everything You Think: Why Your Thinking Is The Beginning &amp; End Of Suffering",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Learn how to overcome anxiety, self-doubt &amp; self-sabotage without needing to rely on motivation or willpower.In this book, you'll discover the root cause of all psychological and emotional suffering and how to achieve freedom of mind to effortlessly create the life you've always wanted to live.Although pain is inevitable, suffering is optional.This book offers a completely new paradigm and understanding of where our human experience comes from, allowing us to end our own suffering and create how we want to feel at any moment.In This Book, You'll Discover: The root cause of all psychological and emotional suffering and how to end itHow to become unaffected by negative thoughts and feelingsHow to experience unconditional love, peace, and joy in the present, no matter what our external circumstances look likeHow to instantly create a new experience of life if you don't like the one you're in right nowHow to break free from a negative thought loop when we inevitably get caught in oneHow to let go of anxiety, self-doubt, self-sabotage, and any self-destructive habitsHow to effortlessly create from a state of abundance, flow, and easeHow to develop the superpower of being okay with not knowing and uncertaintyHow to access your intuition and inner wisdom that goes beyond the limitations of thinkingNo matter what has happened to you, where you are from, or what you have done, you can still find total peace, unconditional love, complete fulfillment, and an abundance of joy in your life.No person is an exception to this. Darkness only exists because of the light, which means even in our darkest hour, light must exist.Within the pages of this book, contains timeless wisdom to empower you with the understanding of our mind's infinite potential to create any experience of life that we want no matter the external circumstances.'Don't Believe Everything You Think' is not about rewiring your brain, rewriting your past, positive thinking or anything of the sort.We cannot solve our problems with the same level of consciousness that created them. Tactics are temporary. An expansion of consciousness is permanent.This book was written to help you go beyond your thinking and discover the truth of what you already intuitively know deep inside your soul.",
    "price": 77.81,
    "discountPrice": 69.95,
    "isbn": "          ",
    "publisher": "LIGHTNING SOURCE INC",
    "publicationDate": "2022-03-28",
    "pages": 126,
    "postedBy": 28
  },
  {
    "id": 48,
    "imageUrl": "https://otimages.com/Bookcover/5409/9780593545409.jpg",
    "title": "Build the Life You Want: The Art and Science of Getting Happier",
    "genre": "Self-Help",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "You can get happier. And getting there will be the adventure of your lifetime. INSTANT #1 NEW YORK TIMES BESTSELLER In Build the Life You Want, Arthur C. Brooks and Oprah Winfrey invite you to begin a journey toward greater happiness no matter how challenging your circumstances. Drawing on cutting-edge science and their years of helping people translate ideas into action, they show you how to improve your life right now instead of waiting for the outside world to change. With insight, compassion, and hope, Brooks and Winfrey reveal how the tools of emotional self-management can change your life―immediately. They recommend practical, research-based practices to build the four pillars of happiness: family, friendship, work, and faith. And along the way, they share hard-earned wisdom from their own lives and careers as well as the witness of regular people whose lives are joyful despite setbacks and hardship. Equipped with the tools of emotional self-management and ready to build your four pillars, you can take control of your present and future rather than hoping and waiting for your circumstances to improve. Build the Life You Want is your blueprint for a better life.",
    "price": 158.56,
    "discountPrice": 142.56,
    "isbn": "0593545400",
    "publisher": "PORTFOLIO",
    "publicationDate": "2023-09-12",
    "pages": 272,
    "postedBy": 3
  },
  {
    "id": 49,
    "imageUrl": "https://otimages.com/Bookcover/0126/9780894860126.jpg",
    "title": "Twenty-Four Hours a Day",
    "genre": "Self-Help",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "This best-selling meditation book for those in recovery offers daily thoughts, meditations, and prayers for living a clean and sober life. Since 1954, Twenty-Four Hours a Day has become a stable force in the recovery of many alcoholics throughout the world. With over nine million copies in print, this \"little black book\" offers daily thoughts, meditations, and prayers for living a clean and sober life. A spiritual resource with practical applications to fit our daily lives.  \"For yesterday is but a dream, and tomorrow is only a vision\" is part of the Sanskrit proverb quoted at the beginning of the book which has become one of the basic building blocks for a life of sobriety. In addition to a thought, meditation and prayer for each day of the year, this handy, pocket-sized volume also contains the Serenity Prayer and the Twelve Steps and Twelve Traditions of Alcoholics Anonymous. It is a simple, yet effective way to help us relate the Twelve Steps to everyday life and helps us find the power not to take that first drink each day.",
    "price": 101.35,
    "discountPrice": 0,
    "isbn": "0894860127",
    "publisher": "HAZELDEN PUB",
    "publicationDate": "1954-01-01",
    "pages": 400,
    "postedBy": 25
  },
  {
    "id": 50,
    "imageUrl": "https://otimages.com/Bookcover/6005/9781616496005.jpg",
    "title": "Drop the Rock--The Ripple Effect: Using Step 10 to Work Steps 6 and 7 Every Day",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Drop the Rock--The Ripple Effect provides multiple perspectives from people successfully working a Twelve Step Program, showing Step 10 as a key to a sober life free of fear and resentment and filled with serenity and gratitude. When Drop the Rock: Removing Character Defects was first published in 1999, it quickly became the standard resource for working Steps 6 and 7, two of the most challenging of the Twelve Steps for many people in recovery. Learning what it means to fully surrender character defects frees you to make amends with Steps 8 and 9, realize the Big Book's \"Promises,\" and move on to Step 10.  In this new follow-up resource, Fred H. explores what he calls \"the ripple effect\" that can be created by using Step 10 to practice Steps 6 and 7 every day and avoid picking up \"the rock\" again. Drawing on his years of lecturing on the Big Book of Alcoholics Anonymous and Twelve Steps and Twelve Traditions,  he reveals Step 10 as the natural culmination of working the previous Steps.",
    "price": 103.03,
    "discountPrice": 92.63,
    "isbn": "1616496002",
    "publisher": "HAZELDEN PUB",
    "publicationDate": "2016-03-29",
    "pages": 120,
    "postedBy": 20
  },
  {
    "id": 51,
    "imageUrl": "https://otimages.com/Bookcover/7714/9780062457714.jpg",
    "title": "The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life",
    "genre": "Self-Help",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "#1 New York Times BestsellerOver 10 million copies soldIn this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be \"positive\" all the time so that we can truly become better, happier people.For decades, we've been told that positive thinking is the key to a happy, rich life. \"F**k positivity,\" Mark Manson says. \"Let's be honest, shit is f**ked and we have to live with it.\" In his wildly popular Internet blog, Manson doesn't sugarcoat or equivocate. He tells it like it is--a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let's-all-feel-good mindset that has infected modern society and spoiled a generation, rewarding them with gold medals just for showing up.Manson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited--\"not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek.There are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives....New York Times Bestseller Over 6 million copies soldIn this generation-defining self-help guide, a superstar blogger shows us that the key to being happier is to stop trying to be \"positive\" all the time and instead to become better at handling adversity.For decades we've been told that positive thinking is the key to a happy, rich life. But those days are over. \"Fuck positivity,\" Mark Manson says. \"Let's be honest; sometimes things are fucked up and we have to live with it.\" For the past few years, Manson--via his wildly popular blog--has been working on correcting our delusional expectations for ourselves and for the world. He now brings his hard-fought wisdom to this groundbreaking book.Manson makes the argument--backed by both academic research and well-timed poop jokes--that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to better stomach lemons. Human beings are flawed and limited--as he writes, \"Not everybody can be extraordinary--there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. This, he says, is the real source of empowerment. Once we embrace our fears, faults, and uncertainties--once we stop running from and avoiding, and start confronting painful truths--we can begin to find the courage and confidence we desperately seek.\"In life, we have a limited amount of fucks to give. So you must choose your fucks wisely.\" Manson brings a much-needed grab-you-by-the-shoulders moment of real-talk, filled with entertaining stories and profane, ruthless humor. This manifesto is a refreshing slap in the face for all of us so that we can start to lead more contented, grounded lives.",
    "price": 145.14,
    "discountPrice": 130.48,
    "isbn": "0062457713",
    "publisher": "HARPER ONE",
    "publicationDate": "2016-09-13",
    "pages": 224,
    "postedBy": 27
  },
  {
    "id": 52,
    "imageUrl": "https://otimages.com/Bookcover/4337/9781585424337.jpg",
    "title": "Think and Grow Rich: The Landmark Bestseller Now Revised and Updated for the 21st Century",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "The bestselling success book of all time is updated and revised with contemporary ideas and examples....The bestselling success book of all time--now revised and updated for the 21st century. Think and Grow Rich has been called the \"Granddaddy of All Motivational Literature.\" It was the first book to boldly ask, \"What makes a winner?\" The man who asked and listened for the answer, Napoleon Hill, is now counted in the top ranks of the world's winners himself. The most famous of all teachers of success spent \"a fortune and the better part of a lifetime of effort\" to produce the \"Law of Success\" philosophy that forms the basis of his books and that is so powerfully summarized in this one.  In the original Think and Grow Rich, published in 1937, Hill draws on stories of Andrew Carnegie, Thomas Edison, Henry Ford, and other millionaires of his generation to illustrate his principles. In the updated version, Arthur R. Pell, Ph.D., a nationally known author, lecturer, and consultant in human resources management and an expert in applying Hill's thought, deftly interweaves anecdotes of how contemporary millionaires and billionaires, such as Bill Gates, Mary Kay Ash, Dave Thomas, and Sir John Templeton, achieved their wealth. Outmoded or arcane terminology and examples are faithfully refreshed to preclude any stumbling blocks to a new generation of readers.",
    "price": 66.25,
    "discountPrice": 59.57,
    "isbn": "1585424331",
    "publisher": "TARCHER JEREMY PUBL",
    "publicationDate": "2005-09-01",
    "pages": 320,
    "postedBy": 17
  },
  {
    "id": 53,
    "imageUrl": "https://otimages.com/Bookcover/1700/9781626251700.jpg",
    "title": "Adult Children of Emotionally Immature Parents: How to Heal from Distant, Rejecting, or Self-Involved Parents",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "If you grew up with an emotionally immature, unavailable, or selfish parent, you may have lingering feelings of anger, loneliness, betrayal, or abandonment. You may recall your childhood as a time when your emotional needs were not met, when your feelings were dismissed, or when you took on adult levels of responsibility in an effort to compensate for your parent's behavior. These wounds can be healed, and you can move forward in your life.In this breakthrough book, clinical psychologist Lindsay Gibson exposes the destructive nature of parents who are emotionally immature or unavailable. You will see how these parents create a sense of neglect, and discover ways to heal from the pain and confusion caused by your childhood. By freeing yourself from your parents' emotional immaturity, you can recover your true nature, control how you react to them, and avoid disappointment. Finally, you'll learn how to create positive, new relationships so you can build a better life.Discover the four types of difficult parents: The emotional parent instills feelings of instability and anxietyThe driven parent stays busy trying to perfect everything and everyoneThe passive parent avoids dealing with anything upsettingThe rejecting parent is withdrawn, dismissive, and derogatory",
    "price": 105.49,
    "discountPrice": 0,
    "isbn": "1626251703",
    "publisher": "NEW HARBINGER PUBN",
    "publicationDate": "2015-06-01",
    "pages": 216,
    "postedBy": 28
  },
  {
    "id": 54,
    "imageUrl": "https://otimages.com/Bookcover/5372/9781572245372.jpg",
    "title": "The Untethered Soul: The Journey Beyond Yourself",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "#1 New York Times bestseller   What would it be like to free yourself from limitations and soar beyond your boundaries? What can you do each day to discover inner peace and serenity? The Untethered Soul offers simple yet profound answers to these questions.Whether this is your first exploration of inner space,  or you've devoted your life to the inward journey, this book will transform your relationship with yourself and the world around you. You'll discover what you can do to put an end to the habitual thoughts and emotions that limit your consciousness. By tapping into traditions of meditation and mindfulness, author and spiritual teacher Michael A. Singer shows how the development of consciousness can enable us all to dwell in the present moment and let go of painful thoughts and memories that keep us from achieving happiness and self-realization.Copublished with the Institute of Noetic Sciences (IONS) The Untethered Soul begins by walking you through your relationship with your thoughts and emotions, helping you uncover the source and fluctuations of your inner energy. It then delves into what you can do to free yourself from the habitual thoughts, emotions, and energy patterns that limit your consciousness. Finally, with perfect clarity, this book opens the door to a life lived in the freedom of your innermost being.The Untethered Soul has already touched the lives of more than a million readers, and is available in a special hardcover gift edition with ribbon bookmark--the perfect gift for yourself, a loved one, or anyone who wants a keepsake edition of this remarkable book.Visit www.untetheredsoul.com for more information.",
    "price": 114.45,
    "discountPrice": 102.88,
    "isbn": "1572245379",
    "publisher": "NEW HARBINGER PUBN",
    "publicationDate": "2007-10-03",
    "pages": 200,
    "postedBy": 28
  },
  {
    "id": 55,
    "imageUrl": "https://otimages.com/Bookcover/4577/9781496454577.jpg",
    "title": "Change Your Brain Every Day: Simple Daily Practices to Strengthen Your Mind, Memory, Moods, Focus, Energy, Habits, and Relationships",
    "genre": "Self-Help",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "Wall Street Journal and Publishers Weekly bestseller366 Days to a Better Brain, Mind, and Life!In Change Your Brain Every Day psychiatrist and clinical neuroscientist Daniel Amen, MD, draws on over 40 years' clinical practice with tens of thousands of patients to give you the most effective daily habits he has seen that can help you improve your brain, master your mind, boost your memory, and make you feel happier, healthier, and more connected to those you love.Incorporating Dr. Amen's tiny habits and practices over the course of a year will help you: Manage your mind to support your happiness, inner peace, and successDevelop lifelong strategies for dealing with whatever stresses come your wayCreate an ongoing sense of purpose in a way that informs your daily actionsLearn major life lessons Dr. Amen has gleaned from studying hundreds of thousands of brain scansImagine what you could learn by spending every day for a year on a psychiatrist's couch. In the pages of Change Your Brain Every Day, you'll get a year's worth of life-changing daily wisdom from Dr. Amen, one of the world's most prominent psychiatrists.Today is the day to start changing the trajectory of your life, one tiny step at a time.",
    "price": 163.79,
    "discountPrice": 0,
    "isbn": "149645457X",
    "publisher": "TYNDALE REFRESH",
    "publicationDate": "2023-03-21",
    "pages": 416,
    "postedBy": 10
  },
  {
    "id": 56,
    "imageUrl": "https://otimages.com/Bookcover/9253/9780761169253.jpg",
    "title": "Steal Like an Artist: 10 Things Nobody Told You about Being Creative",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "A manifesto for the digital age, \"Steal Like an Artist\" is a guide whose positive message, graphic look and illustrations, exercises, and examples will put readers directly in touch with their artistic side....Unlock your creativity.  An inspiring guide to creativity in the digital age, Steal Like an Artist presents ten transformative principles that will help readers discover their artistic side and build a more creative life.  Nothing is original, so embrace influence, school yourself through the work of others, remix and reimagine to discover your own path. Follow interests wherever they take you--what feels like a hobby may turn into you life's work. Forget the old cliché about writing what you know: Instead, write the book you want to read, make the movie you want to watch.  And finally, stay Smart, stay out of debt, and risk being boring in the everyday world so that you have the space to be wild and daring in your imagination and your work.  \"Brilliant and real and true.\"--Rosanne Cash ...Unlock your creativity.Steal like an artist.Don't wait until you know who you are to get started.Write the book you want to read.Use your hands.Side projects and hobbies are important.The secret: do good work and share it with people.Geography is no longer our master.Be nice. (The world is a small town.)Be boring. (It's the only way to get work done.)Creativity is subtraction.",
    "price": 85.95,
    "discountPrice": 77.27,
    "isbn": "0761169253",
    "publisher": "WORKMAN PR",
    "publicationDate": "2012-02-28",
    "pages": 160,
    "postedBy": 7
  },
  {
    "id": 57,
    "imageUrl": "https://otimages.com/Bookcover/8381/9780578828381.jpg",
    "title": "Dear Self,",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "dear self, is a free-flowing collection of gentle reminders and loving affirmations centered around self-love, self-acceptance, growth and healing. This collection takes you on a journey of deep reflection and introspection until you uncover the many layers of yourself that have been waiting to be loved.",
    "price": 67.31,
    "discountPrice": 0,
    "isbn": "0578828383",
    "publisher": "LIGHTNING SOURCE INC",
    "publicationDate": "2021-01-19",
    "pages": 158,
    "postedBy": 18
  },
  {
    "id": 58,
    "imageUrl": "https://otimages.com/Bookcover/9359/9781250849359.jpg",
    "title": "Four Thousand Weeks: Time Management for Mortals",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "AN INSTANT NEW YORK TIMES BESTSELLER*Includes an interview with James Hollis*  \"Provocative and appealing . . . Well worth your extremely limited time.\" --Barbara Spindel, The Wall Street JournalThere's a good reason why everyone has been talking about Oliver Burkeman's New York Times bestseller, Four Thousand Weeks. Nobody needs to be told there isn't enough time. Whether we're starting our own business, or trying to write a novel during our lunch break, or staring down a pile of deadlines as we're planning a vacation, we're obsessed with our lengthening to-do lists, overfilled inboxes, work-life balance, and ceaseless struggle against distraction. We're deluged with advice on becoming more productive and efficient and life hacks to optimize our days. But such techniques often end up making things worse. The sense of anxious hurry grows more intense, and yet the most meaningful parts of life seem to lie just beyond the horizon. Still, we rarely make the connection between our daily struggles with time and the ultimate time management problem: the challenge of how best to use our four thousand weeks, the average length of a human life. Drawing on the insights of both ancient and contemporary philosophers, psychologists, and spiritual teachers, Oliver Burkeman delivers an entertaining, humorous, practical, and ultimately profound guide to time and time management. Rejecting the futile modern obsession with \"getting everything done,\" Four Thousand Weeks introduces readers to tools for constructing a meaningful life by embracing finitude, showing that many of the unhelpful ways we've come to think about time aren't inescapable, unchanging truths, but choices we've made as individuals and as a society--and that we can do things differently.",
    "price": 104.27,
    "discountPrice": 0,
    "isbn": "1250849357",
    "publisher": "PICADOR",
    "publicationDate": "2023-06-27",
    "pages": 304,
    "postedBy": 30
  },
  {
    "id": 59,
    "imageUrl": "/assets/img_cover_placeholder.png",
    "title": "Wisdom from the Four Agreements",
    "genre": "Self-Help",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "This Charming Petite* volume excerpts the bestselling original book in a concise and readable way, presenting \"The Four Agreements: \" Be impeccable with your word; Don't take anything personally; Don't make assumptions; and Always do your best....This Charming Petite(TM) excerpts the best-selling original book in a concise and readable way, presenting The Four Agreements: Be impeccable with your word; Don't take anything personally; Don't make assumptions; and Always do your best.",
    "price": 33,
    "discountPrice": 29.68,
    "isbn": "088088990X",
    "publisher": "PETER PAUPER",
    "publicationDate": "2003-01-01",
    "pages": 0,
    "postedBy": 29
  },
  {
    "id": 60,
    "imageUrl": "https://otimages.com/Bookcover/4834/9781524874834.jpg",
    "title": "The Way Forward",
    "genre": "Self-Help",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "A NEW YORK TIMES, PUBLISHERS WEEKLY, USA TODAY, SUNDAY TIMES,  AND INDIE BESTSELLER The #1 New York Times bestselling poet returns with his most inspiring collection yet. In this third and final installment of his poetic trilogy, Yung Pueblo expands upon favorite themes while guiding readers further, toward a life lived authentically, intuitively, and in harmony with others. In these rapidly changing times, it is more important than ever to know ourselves well and fully, even and especially in the face of turmoil. The Way Forward encourages readers to connect more deeply to their intuition, using it to remain focused and grounded amidst a world in constant flux. In his latest collection of poetry and short prose, Yung Pueblo offers clear strategies for managing the unknown, inhabiting your personal power, and bringing your truest, healthiest self to relationships. Progressing naturally from both Inward and Clarity &amp; Connection, The Way Forward is exactly that­­--an inspired beginning.",
    "price": 102.99,
    "discountPrice": 92.59,
    "isbn": "1524874833",
    "publisher": "ANDREWS &amp; MCMEEL",
    "publicationDate": "2023-10-10",
    "pages": 240,
    "postedBy": 13
  }
]