[
  {
    "id": 1,
    "imageUrl": "https://otimages.com/Bookcover/6573/9781339016573.jpg",
    "title": "The Ballad of Songbirds and Snakes (a Hunger Games Novel)",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Ambition will fuel him.Competition will drive him.But power has its price.It is the morning of the reaping that will kick off the tenth annual Hunger Games. In the Capitol, eighteen-year-old Coriolanus Snow is preparing for his one shot at glory as a mentor in the Games. The once-mighty house of Snow has fallen on hard times, its fate hanging on the slender chance that Coriolanus will be able to outcharm, outwit, and outmaneuver his fellow students to mentor the winning tribute.The odds are against him. He's been given the humiliating assignment of mentoring the female tribute from District 12, the lowest of the low. Their fates are now completely intertwined -- every choice Coriolanus makes could lead to favor or failure, triumph or ruin. Inside the arena, it will be a fight to the death. Outside the arena, Coriolanus starts to feel for his doomed tribute... and must weigh his need to follow the rules against his desire to survive no matter what it takes.",
    "price": 100,
    "discountPrice": 0,
    "isbn": "1339016575",
    "publisher": "SCHOLASTIC",
    "publicationDate": "2023-08-01",
    "pages": 528,
    "postedBy": 27
  },
  {
    "id": 2,
    "imageUrl": "https://otimages.com/Bookcover/5593/9781416995593.jpg",
    "title": "We'll Always Have Summer (Reprint)",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "The internationally bestselling Summer series ends. It's been two years since Conrad told Belly to go with Jeremiah. But now, after Jeremiah makes the worst mistake a boy can make, Belly wonders if she really has a future with Jeremiah. It's time for Belly to decide, once and for all, who has her heart forever....Now an Original Series on Prime Video! Can Belly make a final choice between Jeremiah and Conrad? Find out in the conclusion of the New York Times bestselling The Summer I Turned Pretty trilogy from the author of To All the Boys I've Loved Before (now a major motion picture!). Belly has only ever been in love with two boys, both with the last name Fisher. And after being with Jeremiah for the last two years, she's almost positive he is her soul mate. Almost. While Conrad has not gotten over the mistake of letting Belly go, Jeremiah has always known that Belly is the girl for him. So when Belly and Jeremiah decide to make things forever, Conrad realizes that it's now or never--tell Belly he loves her, or lose her for good. Belly will have to confront her feelings for Jeremiah and Conrad and face the inevitable: She will have to break one of their hearts. This paperback edition features bonus content, including Conrad's letters to Belly and an excerpt of Burn for Burn by Jenny Han and Siobhan Vivian!",
    "price": 70.77,
    "discountPrice": 63.62,
    "isbn": "1416995595",
    "publisher": "SIMON &amp; SCHUSTER BOOKS YOU",
    "publicationDate": "2012-04-24",
    "pages": 320,
    "postedBy": 27
  },
  {
    "id": 3,
    "imageUrl": "https://otimages.com/Bookcover/3528/9780439023528.jpg",
    "title": "The Hunger Games (Hunger Games, Book One): Volume 1",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "The acclaimed author of the \"New York Times\"-bestselling Underland Chronicles series delivers equal parts suspense and philosophy, adventure and romance, in a stunning novel set in a future with unsettling parallels to the present....The first novel in the worldwide bestselling series by Suzanne Collins Winning means fame and fortune. Losing means certain death. The Hunger Games have begun. . . . In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV. Sixteen-year-old Katniss Everdeen regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before-and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weigh survival against humanity and life against love.",
    "price": 88.84,
    "discountPrice": 79.88,
    "isbn": "0439023521",
    "publisher": "HUNGER GAMES",
    "publicationDate": "2010-07-03",
    "pages": 384,
    "postedBy": 30
  },
  {
    "id": 4,
    "imageUrl": "https://otimages.com/Bookcover/7439/9781250857439.jpg",
    "title": "Divine Rivals",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "When two young rival journalists find love through a magical connection, they must face the depths of hell, in a war among gods, to seal their fate forever. After centuries of sleep, the gods are warring again. But eighteen-year-old Iris Winnow just wants to hold her family together. Her mother is suffering from addiction and her brother is missing from the front lines. Her best bet is to win the columnist promotion at the Oath Gazette. To combat her worries, Iris writes letters to her brother and slips them beneath her wardrobe door, where they vanish--into the hands of Roman Kitt, her cold and handsome rival at the paper. When he anonymously writes Iris back, the two of them forge a connection that will follow Iris all the way to the front lines of battle: for her brother, the fate of mankind, and love. Shadow and Bone meets Lore in Rebecca Ross's Divine Rivals, an epic enemies-to-lovers fantasy novel filled with hope and heartbreak, and the unparalleled power of love.",
    "price": 131.14,
    "discountPrice": 117.89,
    "isbn": "1250857430",
    "publisher": "WEDNESDAY BOOKS",
    "publicationDate": "2023-04-04",
    "pages": 368,
    "postedBy": 1
  },
  {
    "id": 5,
    "imageUrl": "https://otimages.com/Bookcover/8290/9781416968290.jpg",
    "title": "The Summer I Turned Pretty",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Belly has spent her summers at the beach house with Conrad and Jeremiah, who had never noticed her noticing them. Every summer Belly hoped it would be different. This time, it is. The summer that Belly turns pretty is the summer that changes everything--for better and for worse....Now an Original Series on Prime Video! Belly has an unforgettable summer in this stunning start to the Summer I Turned Pretty series from the New York Times bestselling author of To All the Boys I've Loved Before (now a major motion picture!), Jenny Han. Some summers are just destined to be pretty. Belly measures her life in summers. Everything good, everything magical happens between the months of June and August. Winters are simply a time to count the weeks until the next summer, a place away from the beach house, away from Susannah, and most importantly, away from Jeremiah and Conrad. They are the boys that Belly has known since her very first summer--they have been her brother figures, her crushes, and everything in between. But one summer, one wonderful and terrible summer, the more everything changes, the more it all ends up just the way it should have been all along.",
    "price": 71.64,
    "discountPrice": 0,
    "isbn": "1416968296",
    "publisher": "SIMON &amp; SCHUSTER BOOKS YOU",
    "publicationDate": "2010-04-06",
    "pages": 304,
    "postedBy": 2
  },
  {
    "id": 6,
    "imageUrl": "https://otimages.com/Bookcover/5489/9781728205489.jpg",
    "title": "If He Had Been with Me",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "A New York Times Bestseller*A BookTok Viral Sensation* An achingly authentic and raw portrait of love, regret, and the life-altering impact of the relationships we hold closest to us, this YA romance bestseller is perfect for fans of Colleen Hoover, Jenny Han, and You've Reached Sam. If he had been with me, everything would have been different...Autumn and Finn used to be inseparable. But then something changed. Or they changed. Now, they do their best to ignore each other.Autumn has her boyfriend Jamie, and her close-knit group of friends. And Finn has become that boy at school, the one everyone wants to be around.That still doesn't stop the way Autumn feels every time she and Finn cross paths, and the growing, nagging thought that maybe things could have been different. Maybe they should be together.But come August, things will change forever. And as time passes, Autumn will be forced to confront how else life might have been different if they had never parted ways...Captivating and heartbreaking,  If He Had Been with Me is perfect for readers looking for: Contemporary teen romance booksUnputdownable &amp; bingeworthy novelsComplex emotional YA storiesTikTok BooksJenny Han meets Dear Even HansonColleen Hover fans",
    "price": 71.71,
    "discountPrice": 64.48,
    "isbn": "1728205484",
    "publisher": "SOURCEBOOKS FIRE",
    "publicationDate": "2019-11-01",
    "pages": 400,
    "postedBy": 15
  },
  {
    "id": 7,
    "imageUrl": "https://otimages.com/Bookcover/6261/9780544336261.jpg",
    "title": "The Giver",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "In Lowry's Newbery Medal-winning classic, 12-year-old Jonas lives in a seemingly ideal world. Not until he is given his life assignment as the Receiver does he begin to understand the dark secrets behind his fragile community....In Lois Lowry's Newbery Medal-winning classic, twelve-year-old Jonas lives in a seemingly ideal world. Not until he is given his life assignment as the Receiver does he begin to understand the dark secrets behind his fragile community.Life in the community where Jonas lives is idyllic. Designated birthmothers produce newchildren, who are assigned to appropriate family units. Citizens are assigned their partners and their jobs. No one thinks to ask questions. Everyone obeys. Everyone is the same. Except Jonas.Not until he is given his life assignment as the Receiver of Memory does he begin to understand the dark, complex secrets behind his fragile community. Gradually Jonas learns that power lies in feelings. But when his own power is put to the test--when he must try to save someone he loves--he may not be ready. Is it too soon? Or too late?Told with deceptive simplicity, this is the provocative story of a boy who experiences something incredible and undertakes something impossible. In the telling it questions every value we have taken for granted and reexamines our most deeply held beliefs.The Giver has become one of the most influential novels of our time. Don't miss the powerful companion novels in Lois Lowry's Giver Quartet: Gathering Blue, Messenger,  and Son.",
    "price": 68.17,
    "discountPrice": 0,
    "isbn": "0544336267",
    "publisher": "HOUGHTON MIFFLIN",
    "publicationDate": "2014-07-01",
    "pages": 240,
    "postedBy": 23
  },
  {
    "id": 8,
    "imageUrl": "https://otimages.com/Bookcover/6391/9781984896391.jpg",
    "title": "A Good Girl's Guide to Murder",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "THE MUST-READ MULTIMILLION BESTSELLING MYSTERY SERIES - Everyone is talking about A Good Girl's Guide to Murder! With shades of Serial and Making a Murderer this is the story about an investigation turned obsession, full of twists and turns and with an ending you'll never expect. Everyone in Fairview knows the story. Pretty and popular high school senior Andie Bell was murdered by her boyfriend, Sal Singh, who then killed himself. It was all anyone could talk about. And five years later, Pip sees how the tragedy still haunts her town. But she can't shake the feeling that there was more to what happened that day. She knew Sal when she was a child, and he was always so kind to her. How could he possibly have been a killer? Now a senior herself, Pip decides to reexamine the closed case for her final project, at first just to cast doubt on the original investigation. But soon she discovers a trail of dark secrets that might actually prove Sal innocent . . . and the line between past and present begins to blur. Someone in Fairview doesn't want Pip digging around for answers, and now her own life might be in danger. And don't miss the sequel, Good Girl, Bad Blood!  \"The perfect nail-biting mystery.\" --Natasha Preston, #1 New York Times bestselling author",
    "price": 69.98,
    "discountPrice": 0,
    "isbn": "1984896393",
    "publisher": "EMBER",
    "publicationDate": "2021-01-05",
    "pages": 400,
    "postedBy": 22
  },
  {
    "id": 9,
    "imageUrl": "https://otimages.com/Bookcover/7486/9781338807486.jpg",
    "title": "Heartstopper #5: A Graphic Novel",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "*Now an acclaimed live-action Netflix series!*Boy meets boy. Boys become friends. Boys fall in love. The bestselling LGBTQ+ graphic novel about life, love, and everything that happens in between: this is the fifth volume of the much-loved HEARTSTOPPER series, featuring gorgeous two-color artwork.Nick and Charlie are in love. They've finally said those three little words, and Charlie has almost persuaded his mum to let him sleep over at Nick's house. He wants to take their relationship to the next level... but can he find the confidence he needs? And with Nick going off to university next year, is everything about to change?By Alice Oseman, winner of the YA Book Prize, Heartstopper encompasses all the small moments of Nick and Charlie's lives that together make up something larger, which speaks to all of us.Contains discussions around mental health and eating disorders, and sexual references.",
    "price": 119.48,
    "discountPrice": 107.41,
    "isbn": "133880748X",
    "publisher": "GRAPHIX",
    "publicationDate": "2023-12-19",
    "pages": 336,
    "postedBy": 10
  },
  {
    "id": 10,
    "imageUrl": "https://otimages.com/Bookcover/0868/9780593650868.jpg",
    "title": "Murtagh: The World of Eragon",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "INSTANT #1 NEW YORK TIMES BESTSELLER - Master storyteller and internationally bestselling author Christopher Paolini returns to the World of Eragon in this stunning epic fantasy set a year after the events of the Inheritance Cycle. Join Dragon Rider--and fan favorite--Murtagh and his dragon as they confront a perilous new enemy!  \"Christopher Paolini is a true rarity.\" --The Washington Post  The world is no longer safe for the Dragon Rider Murtagh and his dragon, Thorn. An evil king has been toppled, and they are left to face the consequences of the reluctant role they played in his reign of terror. Now they are hated and alone, exiled to the outskirts of society.  Throughout the land, hushed voices whisper of brittle ground and a faint scent of brimstone in the air--and Murtagh senses that something wicked lurks in the shadows of Alagaësia. So begins an epic journey into lands both familiar and untraveled, where Murtagh and Thorn must use every weapon in their arsenal, from brains to brawn, to find and outwit a mysterious witch. A witch who is much more than she seems.  In this gripping novel starring one of the most popular characters from Christopher Paolini's blockbuster Inheritance Cycle, a Dragon Rider must discover what he stands for in a world that has abandoned him. Murtagh is the perfect book to enter the World of Eragon for the first time . . . or to joyfully return.  Praise for Christopher Paolini:  \"A spellbinding fantasy writer.\" --The Boston Globe \"A breathtaking and unheard-of success.\" --USA Today \"Make[s] literary magic.\" --People",
    "price": 194.09,
    "discountPrice": 174.48,
    "isbn": "0593650867",
    "publisher": "KNOPF",
    "publicationDate": "2023-11-07",
    "pages": 704,
    "postedBy": 12
  },
  {
    "id": 11,
    "imageUrl": "https://otimages.com/Bookcover/5402/9780759555402.jpg",
    "title": "The Inheritance Games",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "OVER 3 MILLION COPIES SOLD OF THE #1 BESTSELLING SERIES!  Don't miss this New York Times bestselling \"impossible to put down\" (Buzzfeed) novel with deadly stakes, thrilling twists, and juicy secrets--perfect for fans of One of Us is Lying and Knives Out.  Avery Grambs has a plan for a better future: survive high school, win a scholarship, and get out. But her fortunes change in an instant when billionaire Tobias Hawthorne dies and leaves Avery virtually his entire fortune. The catch? Avery has no idea why--or even who Tobias Hawthorne is.  To receive her inheritance, Avery must move into sprawling, secret passage-filled Hawthorne House, where every room bears the old man's touch--and his love of puzzles, riddles, and codes. Unfortunately for Avery, Hawthorne House is also occupied by the family that Tobias Hawthorne just dispossessed. This includes the four Hawthorne grandsons: dangerous, magnetic, brilliant boys who grew up with every expectation that one day, they would inherit billions. Heir apparent Grayson Hawthorne is convinced that Avery must be a conwoman, and he's determined to take her down. His brother, Jameson, views her as their grandfather's last hurrah: a twisted riddle, a puzzle to be solved. Caught in a world of wealth and privilege with danger around every turn, Avery will have to play the game herself just to survive.  **The games continue in The Hawthorne Legacy, The Final Gambit, and The Brothers Hawthorne!",
    "price": 71.73,
    "discountPrice": 0,
    "isbn": "0759555400",
    "publisher": "LITTLE BROWN BOOKS FOR YOUNG R",
    "publicationDate": "2021-07-27",
    "pages": 400,
    "postedBy": 1
  },
  {
    "id": 12,
    "imageUrl": "https://otimages.com/Bookcover/7436/9781338617436.jpg",
    "title": "Heartstopper #1: A Graphic Novel: Volume 1",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "Boy meets boy. Boys become friends. Boys fall in love. A sweet and charming coming-of-age story that explores friendship, love, and coming out. This edition features beautiful two-color artwork.Now streaming on Netflix!Shy and softhearted Charlie Spring sits next to rugby player Nick Nelson in class one morning. A warm and intimate friendship follows, and that soon develops into something more for Charlie, who doesn't think he has a chance.But Nick is struggling with feelings of his own, and as the two grow closer and take on the ups and downs of high school, they come to understand the surprising and delightful ways in which love works.",
    "price": 97.02,
    "discountPrice": 0,
    "isbn": "1338617435",
    "publisher": "GRAPHIX",
    "publicationDate": "2020-05-05",
    "pages": 288,
    "postedBy": 4
  },
  {
    "id": 13,
    "imageUrl": "https://otimages.com/Bookcover/7453/9781250857453.jpg",
    "title": "Ruthless Vows",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "The epic conclusion to the intensely romantic and beautifully written story that started in Divine Rivals. Two weeks have passed since Iris Winnow returned home bruised and heartbroken from the front, but the war is far from over. Roman is missing, and the city of Oath continues to dwell in a state of disbelief and ignorance. When Iris and Attie are given another chance to report on Dacre's movements, they both take the opportunity and head westward once more despite the danger, knowing it's only a matter of time before the conflict reaches a city that's unprepared and fracturing beneath the chancellor's reign. Since waking below in Dacre's realm, Roman cannot remember his past. But given the reassurance that his memories will return in time, Roman begins to write articles for Dacre, uncertain of his place in the greater scheme of the war. When a strange letter arrives by wardrobe door, Roman is first suspicious, then intrigued. As he strikes up a correspondence with his mysterious pen pal, Roman will soon have to make a decision: to stand with Dacre or betray the god who healed him. And as the days grow darker, inevitably drawing Roman and Iris closer together...the two of them will risk their very hearts and futures to change the tides of the war.",
    "price": 127.44,
    "discountPrice": 114.56,
    "isbn": "1250857457",
    "publisher": "WEDNESDAY BOOKS",
    "publicationDate": "2023-12-26",
    "pages": 432,
    "postedBy": 18
  },
  {
    "id": 14,
    "imageUrl": "https://otimages.com/Bookcover/5171/9781338635171.jpg",
    "title": "The Ballad of Songbirds and Snakes (a Hunger Games Novel)",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "Ambition will fuel him.Competition will drive him.But power has its price.It is the morning of the reaping that will kick off the tenth annual Hunger Games. In the Capitol, eighteen-year-old Coriolanus Snow is preparing for his one shot at glory as a mentor in the Games. The once-mighty house of Snow has fallen on hard times, its fate hanging on the slender chance that Coriolanus will be able to outcharm, outwit, and outmaneuver his fellow students to mentor the winning tribute. The odds are against him. He's been given the humiliating assignment of mentoring the female tribute from District 12, the lowest of the low. Their fates are now completely intertwined -- every choice Coriolanus makes could lead to favor or failure, triumph or ruin. Inside the arena, it will be a fight to the death. Outside the arena, Coriolanus starts to feel for his doomed tribute... and must weigh his need to follow the rules against his desire to survive no matter what it takes.",
    "price": 161.23,
    "discountPrice": 144.95,
    "isbn": "1338635174",
    "publisher": "SCHOLASTIC",
    "publicationDate": "2020-05-19",
    "pages": 528,
    "postedBy": 13
  },
  {
    "id": 15,
    "imageUrl": "https://otimages.com/Bookcover/8402/9781250268402.jpg",
    "title": "Once Upon a Broken Heart",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "#1 NEW YORK TIMES BESTSELLER! ONCE UPON A BROKEN HEART marks the launch of a new series from Stephanie Garber about love, curses, and the lengths that people will go to for happily ever after  For as long as she can remember, Evangeline Fox has believed in true love and happy endings . . . until she learns that the love of her life will marry another. Desperate to stop the wedding and to heal her wounded heart, Evangeline strikes a deal with the charismatic, but wicked, Prince of Hearts. In exchange for his help, he asks for three kisses, to be given at the time and place of his choosing. But after Evangeline's first promised kiss, she learns that bargaining with an immortal is a dangerous game -- and that the Prince of Hearts wants far more from her than she'd pledged. He has plans for Evangeline, plans that will either end in the greatest happily ever after, or the most exquisite tragedy.",
    "price": 79.7,
    "discountPrice": 0,
    "isbn": "1250268400",
    "publisher": "FLATIRON BOOKS",
    "publicationDate": "2023-03-28",
    "pages": 432,
    "postedBy": 26
  },
  {
    "id": 16,
    "imageUrl": "https://otimages.com/Bookcover/5562/9781416995562.jpg",
    "title": "It's Not Summer Without You",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "In Han's follow-up to \"The Summer I Turned Pretty,\" Belly finds out what comes after falling in love....Now an Original Series on Prime Video! Belly finds out what comes after falling in love in this follow-up to The Summer I Turned Pretty from the New York Times bestselling author of To All the Boys I've Loved Before (now a major motion picture!), Jenny Han. It used to be that Belly counted the days until summer, until she was back at Cousins Beach with Conrad and Jeremiah. But not this year. Not after Susannah got sick again and Conrad stopped caring. Everything that was right and good has fallen apart, leaving Belly wishing summer would never come. But when Jeremiah calls saying Conrad has disappeared, Belly knows what she must do to make things right again. And it can only happen back at the beach house, the three of them together, the way things used to be. If this summer really and truly is the last summer, it should end the way it started--at Cousins Beach.",
    "price": 72.23,
    "discountPrice": 64.94,
    "isbn": "1416995560",
    "publisher": "SIMON &amp; SCHUSTER BOOKS YOU",
    "publicationDate": "2011-04-05",
    "pages": 320,
    "postedBy": 30
  },
  {
    "id": 17,
    "imageUrl": "https://otimages.com/Bookcover/0314/9780316310314.jpg",
    "title": "The Cruel Prince",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "An instant bestseller from #1 \"New York Times\"-bestselling author Black--the first book in her Folk of the Air series about a mortal girl who finds herself caught in a web of royal faerie intrigue.igue....By #1 New York Times bestselling author Holly Black, the first book in a stunning new series about a mortal girl who finds herself caught in a web of royal faerie intrigue.  Of course I want to be like them. They're beautiful as blades forged in some divine fire. They will live forever.  And Cardan is even more beautiful than the rest. I hate him more than all the others. I hate him so much that sometimes when I look at him, I can hardly breathe.  Jude was seven years old when her parents were murdered and she and her two sisters were stolen away to live in the treacherous High Court of Faerie. Ten years later, Jude wants nothing more than to belong there, despite her mortality. But many of the fey despise humans. Especially Prince Cardan, the youngest and wickedest son of the High King.  To win a place at the Court, she must defy him--and face the consequences.  In doing so, she becomes embroiled in palace intrigues and deceptions, discovering her own capacity for bloodshed. But as civil war threatens to drown the Courts of Faerie in violence, Jude will need to risk her life in a dangerous alliance to save her sisters, and Faerie itself.",
    "price": 80.95,
    "discountPrice": 72.77,
    "isbn": "031631031X",
    "publisher": "LITTLE BROWN &amp; CO",
    "publicationDate": "2018-12-04",
    "pages": 416,
    "postedBy": 16
  },
  {
    "id": 18,
    "imageUrl": "https://otimages.com/Bookcover/7637/9781534467637.jpg",
    "title": "Better Than the Movies",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "A USA TODAY and New York Times bestseller Perfect for fans of Kasie West and Jenn Bennett, this \"sweet and funny\" (Kerry Winfrey, author of Waiting for Tom Hanks) teen rom-com follows a hopelessly romantic teen girl and her cute yet obnoxious neighbor as they scheme to get her noticed by her untouchable crush. Perpetual daydreamer Liz Buxbaum gave her heart to Michael a long time ago. But her cool, aloof forever crush never really saw her before he moved away. Now that he's back in town, Liz will do whatever it takes to get on his radar--and maybe snag him as a prom date--even befriend Wes Bennet. The annoyingly attractive next-door neighbor might seem like a prime candidate for romantic comedy fantasies, but Wes has only been a pain in Liz's butt since they were kids. Pranks involving frogs and decapitated lawn gnomes do not a potential boyfriend make. Yet, somehow, Wes and Michael are hitting it off, which means Wes is Liz's in. But as Liz and Wes scheme to get Liz noticed by Michael so she can have her magical prom moment, she's shocked to discover that she likes being around Wes. And as they continue to grow closer, she must reexamine everything she thought she knew about love--and rethink her own ideas of what Happily Ever After should look like.",
    "price": 78.84,
    "discountPrice": 70.88,
    "isbn": "1534467637",
    "publisher": "SIMON &amp; SCHUSTER BOOKS YOU",
    "publicationDate": "2022-07-26",
    "pages": 384,
    "postedBy": 14
  },
  {
    "id": 19,
    "imageUrl": "https://otimages.com/Bookcover/0772/9780316480772.jpg",
    "title": "The Brothers Hawthorne",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Hardcover",
    "language": "English",
    "description": "OVER 3 MILLION COPIES SOLD OF THE #1 BESTSELLING SERIES! Four brothers. Two missions. One explosive read. Jennifer Lynn Barnes returns to the world of her #1 bestselling, TikTok sensation Inheritance Games trilogy, and the stakes have never been higher.  Grayson Hawthorne was raised as the heir apparent to his billionaire grandfather, taught from the cradle to put family first. Now the great Tobias Hawthorne is dead and his family disinherited, but some lessons linger. When Grayson's half-sisters find themselves in trouble, he swoops in to do what he does best: take care of the problem--efficiently, effectively, mercilessly. And without getting bogged down in emotional entanglements. Jameson Hawthorne is a risk-taker, a sensation-seeker, a player of games. When his mysterious father appears and asks for a favor, Jameson can't resist the challenge. Now he must infiltrate London's most exclusive underground gambling club, which caters to the rich, the powerful, and the aristocratic, and win an impossible game of greatest stakes. Luckily, Jameson Hawthorne lives for impossible.  Drawn into twisted games on opposite sides of the globe, Grayson and Jameson--with the help of their brothers and the girl who inherited their grandfather's fortune--must dig deep to decide who they want to be and what each of them will sacrifice to win.  It doesn't end here--Avery and the Hawthornes will be back in The Grandest Game! Pre-order now!",
    "price": 126.53,
    "discountPrice": 113.75,
    "isbn": "0316480770",
    "publisher": "LITTLE BROWN BOOKS FOR YOUNG R",
    "publicationDate": "2023-08-29",
    "pages": 480,
    "postedBy": 8
  },
  {
    "id": 20,
    "imageUrl": "https://otimages.com/Bookcover/9919/9780593619919.jpg",
    "title": "Check &amp; Mate",
    "genre": "Young Adult Fiction",
    "bindingDescription": "Paperback",
    "language": "English",
    "description": "In this clever and swoonworthy YA debut from the New York Times bestselling author of The Love Hypothesis, life's moving pieces bring rival chess players together in a match for the heart. Mallory Greenleaf is done with chess. Every move counts nowadays; after the sport led to the destruction of her family four years earlier, Mallory's focus is on her mom, her sisters, and the dead-end job that keeps the lights on. That is, until she begrudgingly agrees to play in one last charity tournament and inadvertently wipes the board with notorious \"Kingkiller\" Nolan Sawyer: current world champion and reigning Bad Boy of chess. Nolan's loss to an unknown rook-ie shocks everyone. What's even more confusing? His desire to cross pawns again. What kind of gambit is Nolan playing? The smart move would be to walk away. Resign. Game over. But Mallory's victory opens the door to sorely needed cash-prizes and despite everything, she can't help feeling drawn to the enigmatic strategist.... As she rockets up the ranks, Mallory struggles to keep her family safely separated from the game that wrecked it in the first place. And as her love for the sport she so desperately wanted to hate begins to rekindle, Mallory quickly realizes that the games aren't only on the board, the spotlight is brighter than she imagined, and the competition can be fierce (-ly attractive. And intelligent...and infuriating...)",
    "price": 84.31,
    "discountPrice": 0,
    "isbn": "0593619919",
    "publisher": "PUTNAM YOUNG READERS",
    "publicationDate": "2023-11-07",
    "pages": 368,
    "postedBy": 19
  }
]